{
  "Help and help subcommand ": {
    "description": "Lists all the subcommands available for use with RACADM and provides a short description about each\nsubcommand. You may also type a subcommand, group, object or Fully Qualified Descriptor (FQDD) name\nafter help.",
    "syntax": "racadm help\n● racadm help <subcommand>",
    "input": "<subcommand> — specifies the subcommand for which you need the help information.\n● <device name> — specifies the device name such as iDRAC, BIOS, NIC, LifecycleController, FC,\nsystem, or Storage.\n● <group> — specifies the group name supported by the corresponding device.\n● <object> — specifies the object for the entered group.",
    "output": "The help command displays a complete list of subcommands.\n● The racadm help <subcommand> command displays information for the specified subcommand\nonly.\n● The racadm help <device name> <Group> command displays information for the specified\ngroup.\n● The racadm help <device name> <Group> <Object> command displays information for the\nspecified object.\nNOTE: help for NIC/FC/Infiniband vendor implementation specific attributes are fetched from the\nrespective vendors and may not be complete for few attributes.",
    "example": "To display the help information about InfiniBand FQDD\nracadm help <InfiniBand FQDD>"
  },
  "ackdriveremoval ": {
    "description": "The plug-in subcommand acknowledges drive removal and clears the amber state of the chassis LED to\nhealthy state.",
    "syntax": "racadm ackdriveremoval -d <drive_id> -b <bay_id>\n● racadm ackdriveremoval --all",
    "input": "--all—Acknowledge all the drive removal.\n● -d—Drive ID to acknowledge drive removal.\n● -b—Bay ID to acknowledge drive removal.",
    "example": "To acknowledge all the drive removal\nracadm ackdriveremoval --all\nTo acknowledge the drive removal for a given drive and bay id:\nracadm ackdriveremoval -d 2 -b 0"
  },
  "arp ": {
    "description": "Displays the contents of the Address Resolution Protocol (ARP) table. ARP table entries cannot be\nadded or deleted.\n● To use this command, you must have Debug privilege.",
    "syntax": "racadm arp",
    "input": "N/A",
    "example": "racadm arp\nAddress\tHW Type\tHW Address\tMask\tDevice\n192.168.1.1\tEther\t00:0d:65:f3:7c:bf\tC\teth0"
  },
  "autoupdatescheduler ": {
    "description": "You can automatically update the firmware of the devices on the server. To run this subcommand, you\nmust have the Server Control privilege.\nNOTE:\n● The autoupdatescheduler subcommand can be enabled or disabled.\n● Lifecycle Controller and CSIOR may not be enabled to run this subcommand.\n● The autoupdatescheduler can be enabled or disabled.\n● The minimum Lifecycle Controller version required is Lifecycle Controller 1.3.\n● When a job is already scheduled and the clear command is run, the scheduling parameters are\ncleared.\n● If the network share is not accessible or the catalog file is missing when the job is scheduled, then\nthe job is unsuccessful.",
    "syntax": "To create the AutoUpdateScheduler, run the command.\nracadm autoupdatescheduler create -u <user> -p <password> -l\n<location> -f <filename> -time <time> -dom <DayOfMonth> -wom\n<WeekOfMonth> -dow <DayofWeek> -rp <repeat> -a <applyreboot> -ph\n<proxyHost> -pu <proxyUser> -pp <proxyPassword> -po <proxyPort> -pt\n<proxyType>\n● To view the AutoUpdateScheduler parameter, run the command.\nracadm autoupdatescheduler view\n● To clear and display AutoUpdateScheduler parameter, run the command.\nracadm autoupdatescheduler clear\nNOTE: After the parameters are cleared, the AutoUpdateScheduler is disabled. To schedule the\nupdate again, enable the AutoUpdateScheduler.",
    "input": "Valid options\n● -u — Specifies the username of the remote share that stores the catalog file.\nNOTE: For CIFS, enter the domain name as domain or username.\n● -p — Specifies the password of the remote share that stores the catalog file.\n● -l — Specifies the network share (NFS, CIFS, FTP, TFTP, HTTP, or HTTPS) location of the catalog\nfile. IPv4 and IPv6 addresses are supported.\n● -f — Specifies the catalog location and the filename. If the filename is not specified, then the default\nfile used is catalog.xml.\nNOTE: If the file is in a subfolder within the share location, then enter the network share location\nin the –l option and enter the subfolder location and the filename in the –f option.\n● -ph — Specifies the FTP/HTTP proxy hostname.\n● -pu — Specifies the FTP/HTTP proxy username.\n● -pp — Specifies the FTP/HTTP proxy password.\n● -po — Specifies the FTP/HTTP proxy port.\n● -pt — Specifies the FTP/HTTP proxy type.\n● -time — Specifies the time to schedule an autoupdate in the HH:MM format. This option must be\nspecified.\n● -dom — Specifies the day of month to schedule an autoupdate. Valid values are 1–28, L (Last day) or\n'*' (default—any day).\n● -wom — Specifies the week of month to schedule an autoupdate. Valid values are 1–4, L (Last week)\nor '*' (default—any week).\n● -dow — Specifies the day of week to schedule an autoupdate. Valid values are sun, mon, tue, wed,\nthu, fri, sat, or '*' (default—any day).\nNOTE: The -dom, -wom, or -dow option must be included in the command for the autoupdate\nschedule. The * value for the options must be included within ' ' (single quotation mark).\n● If the -dom option is specified, then the -wom and -dow options are not required.\n● If the-wom option is specified, then the-dow is required and -dom is not required.\n● If the-dom option is non-'*', then the schedule repeats by month.\n● If the-wom option is non-'*', then the schedule repeats by month.\n● If the-dom and -wom options are '*' and the -dow option is non-'*', then the schedule repeats by\nweek.\n● If all the three -dom, -wom and -dow options are '*', then the schedule repeats by day.\n● -rp — Specifies the repeat parameter. This parameter must be specified.\n○ If the-dom option is specified, then the valid values for -rp are 1–12.\n○ If the-wom option is specified, then the valid values for -rp are 1–52.\n○ If the-dow option is specified, then the valid values for -rp are 1–366.\n● -a — Applies reboot (1—Yes, 0—No). This option must be specified.\n○ To clear and display AutoUpdateScheduler parameter:\nracadm autoupdatescheduler clear\nRAC1047: Successfully cleared the Automatic Update (autoupdate)\nfeature settings"
  },
  "bioscert ": {
    "description": "Allows you to\n● View the installed Secure Boot Certificates. To view, you must have the Login privilege.\n● Export the Secure Boot Certificate to a remote share or local system. To export, you must have the\nLogin privilege.\n● Import the Secure Boot Certificate from a remote share or local system. To import, you must have login\nand system control privilege.\n● Delete the installed Secure Boot Certificate. To delete, you must have login and system control\nprivilege.\n● Restore the installed Secure Boot Certificate Sections. To restore, you must have login and system\ncontrol privilege.",
    "syntax": "To view the installed Secure Boot Certificates\nracadm bioscert view –all\n● To export the Secure Boot Certificate to a remote share or local system.\nracadm bioscert view -t <keyType> -k <KeySubType> -v <HashValue or\nThumbPrintValue>\n● racadm bioscert export -t <keyType> -k <KeySubType> -v <HashValue\nor ThumbPrintValue> -f <filename> -l <CIFS/NFS/HTTP/HTTPS share> -u\n<username> -p <password>\n● racadm bioscert import -t <keyType> -k <KeySubType> -f <filename> -l\n<CIFS/NFS/HTTP/HTTPS share> -u <username> -p <password>\n● racadm bioscert delete –all\n● racadm bioscert delete -t <keyType> -k <KeySubType> -v <HashValue or\nThumbPrintValue>\n● racadm bioscert restore –all\n● racadm bioscert restore -t <keyType>",
    "input": "-t— Specifies the key type of the Secure Boot Certificate to be exported.\n○ 0—Specifies the PK (Platform Key)\n○ 1—Specifies the KEK (Key Exchange Key)\n○ 2—Specifies the DB (Signature Database)\n○ 3—Specifies the DBX (Forbidden signatures Database)\n● -k — Specifies the Certificate type or the Hash type of the Secure Boot Certificate file to be exported.\n○ 0—Specifies the Certificate type\n○ 1—Specifies the Hash type (SHA - 256)\nracadm bioscert view -t <keyType> -k <KeySubType> -v <HashValue or\nThumbPrintValue>\nracadm bioscert export -t <keyType> -k <KeySubType> -v <HashValue\nor ThumbPrintValue> -f <filename> -l <CIFS/NFS/HTTP/HTTPS share> -u\n<username> -p <password>\nracadm bioscert import -t <keyType> -k <KeySubType> -f <filename> -l\n<CIFS/NFS/HTTP/HTTPS share> -u <username> -p <password>\nracadm bioscert delete –all\nracadm bioscert delete -t <keyType> -k <KeySubType> -v <HashValue or\nThumbPrintValue>\nracadm bioscert restore –all\nracadm bioscert restore -t <keyType>\n○ 2—Specifies the Hash type (SHA - 384)\n○ 3—Specifies the Hash type (SHA - 512)\n● -v— Specifies the Thumbprint value or the Hash value of the Secure Boot Certificate file to be\nexported.\n● -f—Specifies the file name of the exported Secure Boot Certificate.\n● -l—Specifies the network location to where the Secure Boot Certificate file must be exported.\n● -u—Specifies the username for the remote share to where the Secure Boot Certificate file must be\nexported.\n● -p—Specifies the password for the remote share to where the Secure Boot Certificate file must be\nexported.\n● Import a KEK certificate from a local share using Local RACADM.\nracadm bioscert import -t 1 -k 0 -f kek_cert.der\n● Import a KEK certificate from a local share using remote RACADM.\nracadm -r 10.94.161.119 -u root -p calvin bioscert import -t 1 -k 0 -f\nkek_cert.der\n● To delete an installed KEK Secure Boot Certificate\nracadm bioscert delete -t 3 -k 0 -v\n416e3e4a6722a534afba9040b6d6a69cc313f1e48e7959f57bf248d543d00245\n● To delete an installed DBX Secure Boot Certificate of HASH type SHA-256.\nracadm bioscert delete -t 3 -k 1 -v\n416e3e4a6722a534afba9040b6d6a69cc313f1e48e7959f57bf248d543d00245\n● To delete all the installed KEK Secure Boot Certificates\nracadm bioscert delete --all\n● To restore the installed KEK Secure Boot Certificates\nracadm bioscert restore -t 1\n● To restore all the installed Secure Boot Certificates\nracadm bioscert restore --all"
  },
  "biosscan ": {
    "description": "Allows iDRAC to scan the BIOS on scheduled intervals or as requested by the user.",
    "syntax": "To schedule BIOS scanning\nracadm biosscan -s <Frequency Type>\nor\nracadm biosscan -s <frequency> -t <start-time> -d <start-date>",
    "input": "-s—Specifies the type of schedule for BIOS scan.\n○ 0—Never schedule for BIOS scan and deletes existing schedules\n○ 1—Schedule now\n○ 2—Schedule daily\n○ 3—Schedule weekly\n○ 4—Schedule monthly\n○ 5—Schedule yearly\n● -t<HH:00>—Schedule start time in a 24-hour format. Specifying minute is not supported, therefore\nthe minute value must be set as 00. The default time is set to 23:00 if time is not specified.\n● -d<YYYY-MM-DD>—Schedule start date. The default date is set to the current date when the date is\nnot specified.\nNOTE: -t and -d inputs must be specified together and are not applicable for -s 0 and -s 1.\nNOTE: In modular systems, the scheduled start time (minutes) may vary based on the server slot\nnumber.",
    "example": "To perform the BIOS Scan immediately\nracadm biosscan -s 1\n● To perform the BIOS Scan daily:\nracadm biosscan -s 2\n● To perform BIOS scan weekly at 2100 Hrs from December 20, 2020:\nracadm biosscan -s 3 -t 21:00 -d 2020-12-20\n● To perform BIOS scan weekly from today at default time 23:00:\nracadm biosscan -s 3"
  },
  "cd ": {
    "description": "To change the current working object, use this command.",
    "syntax": "racadm>> cd <object>",
    "input": "racadm>> cd <object>",
    "output": "Displays the new prompt.",
    "example": "Example 1: To navigate to the system device type directory\nracadm>>cd system\nracadm/system>\n● Example 2: To run all the power-related get or set commands:\nracadm/system>cd power\nracadm/Power>"
  },
  "clearasrscreen ": {
    "description": "Clears the last crash (ASR) screen that is in memory. For more information, see \"Enabling Last Crash\nScreen\" section in Integrated Dell Remote Access Controller User's Guide..\nNOTE: To run this subcommand, you must have the Clear Logs permission.",
    "syntax": "racadm clearasrscreen"
  },
  "Input ": {
    "output": "Clears the last crash screen buffer.",
    "example": "racadm clearasrscreen"
  },
  "clearpending ": {
    "description": "Deletes the pending values of all the attributes (objects) in the device (NIC, BIOS, FC, and Storage).\nNOTE: If any attribute is not modified or a job is already scheduled for the same device, then the\npending state is not cleared or deleted.",
    "syntax": "racadm clearpending <FQDD>",
    "input": "<FQDD> — The values are\n● BIOS FQDD\n● NIC FQDD\n● InfiniBand FQDD\n● FC FQDD\n● Storage controller FQDD",
    "output": "A message is displayed indicating that the pending state is cleared or deleted.",
    "example": "To clear the pending state of NIC device\nracadm clearpending NIC.Integrated.1-1\n● To clear the pending state of InfiniBand device\nracadm clearpending <InfiniBand FQDD>"
  },
  "closessn ": {
    "description": "Closes a communication session on the device. Use getssninfo to view a list of sessions that can be\nclosed using this command. To run this subcommand, you must have the Administrator permission.\nNOTE: This subcommand ends all the sessions other than the current session.",
    "syntax": "racadm closessn –i <session_ID>\n● racadm closessn -a\n● racadm closessn -u <username>\nracadm closessn –i <session_ID>\nracadm closessn -a\nracadm closessn -u <username>",
    "input": "—i <session_ID> — The session ID of the session to close, which can be retrieved using RACADM\ngetssninfo subcommand. Session running this command cannot be closed.\n● —a — Closes all sessions.\n● —u <username> — Closes all sessions for a particular user name.",
    "output": "Successful or error message is displayed.",
    "example": "Closes the session 1234.\nracadm closessn -i 1234\n● Closes all the sessions other then the active session for root user.\nracadm closessn –u root\n● Closes all the sessions.\nracadm closessn –a"
  },
  "clrsel ": {
    "description": "Removes all the existing records from the System Event Log (SEL).\n● To use this subcommand, you must have Clear Logs permission.",
    "syntax": "racadm clrsel",
    "example": "racadm clrsel\nThe SEL was cleared successfully"
  },
  "cmreset ": {
    "description": "This command is used to perform a chassis manager reset operation.",
    "syntax": "NOTE: This command is only supported on DCS systems.\n● racadm cmreset",
    "example": "To perform the chassis manager reset operation.\nracadm cmreset"
  },
  "connect ": {
    "description": "Allows you to connect to the switch or blade serial console.\nNOTE: This subcommand is only supported on the firmware interface.",
    "syntax": "racadm connect [-b] -m <module>",
    "input": "-b—binary mode.\nNOTE: If -b is used, CMC must be reset to terminate connect.\n● -m—module, and can be one of the following values:\n○ server-<n>—where n = 1 to 16\n○ server-<nx>—where n = 1 to 8 and x = a to d\n○ switch-n—where n = 1 to 6 or <a1 | a2 | b1 | b2 | c1 | c2>",
    "example": "s\t● To connect to I/O Module 1 serial console\nracadm connect -m switch-1\n● To connect to server 1 serial console:\nracadm connect -m server-1"
  },
  "coredump ": {
    "description": "Displays the list of RAC coredump files. If available, the coredump information is persistent across\niDRAC power cycles and remains available until either of the following conditions occur: The\ncoredump information is deleted using the coredumpdelete subcommand. For more information\nabout clearing the coredump, see the coredumpdelete.\nNOTE: To use this subcommand, you must have the Execute Debug privilege.",
    "syntax": "racadm coredump",
    "example": "racadm coredump\nThere is no coredump currently available.\n● racadm coredump\n<size> <date & time> <name>\n863 Feb 8 05:56 corefile1.gz\n31 Feb 8 05:56 corefile2.gz\n322 Feb 8 05:56 corefile3.gz\nNOTE: The output displays the file size in kilobytes.\nracadm coredump\nThere is no coredump currently available.\nracadm coredump\n<size> <date & time> <name>\n863 Feb 8 05:56 corefile1.gz\n31 Feb 8 05:56 corefile2.gz\n322 Feb 8 05:56 corefile3.gz"
  },
  "coredumpdelete ": {
    "description": "Deletes any currently available coredump data stored in the RAC. To use this subcommand, you must have\nExecute Debug Command permission.\nNOTE: If a coredumpdelete command is issued and a coredump is not currently stored in the RAC,\nthe command displays a success message. This behavior is expected. See the coredump subcommand\nfor more information about viewing a coredump.",
    "syntax": "racadm coredumpdelete [-f <coreFileName>][--all]",
    "output": "Coredump is deleted.",
    "input": "-f <coreFileName>— Specifies the name of the core file to be deleted.\n● --all— Deletes all core files.",
    "example": "To delete a specific core file\nracadm coredumpdelete -f corefile.gz\n● To delete all core files\nracadm coredumpdelete --all"
  },
  "coredumpexport ": {
    "description": "Exports the RAC coredump files.",
    "syntax": "racadm coredumpexport -f <filename> -l <NFS or CIFS share> -u <username>\n-p <password>",
    "output": "Coredump files exported successfully",
    "input": "-u <username> —Username of the remote share to where the file must be exported.\n● -p <password> —Password for the remote share to where the file must be exported.\n● -l <location> —NFS/CIFS Network share location to where the file must be exported.\n● -f <filename> —Core file to be exported.",
    "example": "Export a particular coredump file to a remote CIFS share\nracadm coredumpexport -f corefile.gz -u admin -p mypass -l //1.2.3.4/\nshare\n● Export a particular coredump file to a remote NFS share:\nracadm coredumpexport -f corefile.gz -u admin -p mypass -l 1.2.3.4:/\nshare"
  },
  "diagnostics ": {
    "description": "Collects and exports remote diagnostics report from iDRAC. The results of the latest successfully run\nremote diagnostics are available and retrievable remotely through an NFS, CIFS, HTTP, or HTTPS) share.",
    "syntax": "To run a remote diagnostic report\nracadm diagnostics run -m <mode> -r <reboot type> -s <start time> -e\n<expiration time>\nNone\tTo export a remote diagnostic report:\nracadm diagnostics export -f <file name> -l <NFS,CIFS,HTTP,or HTTPS\nshare location> -u <username> -p <password>",
    "input": "—m <mode>—Specifies the type of diagnostic mode. The types are\n○ Collect and export remote diagnostics report from the iDRAC. The results of the latest successfully\nexecuted remote Diagnostics will be available and retrievable remotely through the NFS, CIFS,\nHTTP, and HTTPS share.\n○ 0(Express)—The express mode executes a subset of diagnostic tests.\n○ 1(Extended)—The extended mode executes all available diagnostics tests.\n○ 2(Both)—Runs express and extended tests serially in sequence.\n● -f <filename>—Specifies the name of the configuration file.\n● -l—Specifies the location of the network share (NFS, CIFS, HTTP, and HTTPS).\n● -u <username>—Specifies the user name of the remote share to import the file.\n● -p <password>—Specifies the password of the remote share to import the file.\n● -r <reboot type>—Specifies the reboot type. The type can be one of the following:\n○ pwrcycle—Power cycle\n○ Graceful —Graceful reboot without forced shutdown\n○ Forced—Graceful reboot with forced shutdown\n● -s <start time>—Specifies the start time for the scheduled job in yyyymmddhhmmss format.\nThe default value TIME_NOW starts the job immediately.\n● -e <expiration time>—Specifies the expiry time for the scheduled job in yyyymmddhhmmss\nformat. The default value TIME_NA does not apply the waiting time.\nNOTE: For the diagnostic report run operation, the time difference between the -s and -e options\nmust be more than five minutes.",
    "output": "Provides the Job ID for the diagnostic operation.\n● To export a remote diagnostics report to the HTTPS share:\nracadm diagnostics export -f diags.txt -u httpsuser -p httpspwd -l\nhttps://test.com\n● To export a remote diagnostics report to a local share:\nracadm diagnostics export -f diags.txt"
  },
  "driverpack ": {
    "description": "Installs the driver pack for the operating system.",
    "syntax": "To get information about the available driver packs\nracadm driverpack getinfo\nNone\tTo attach the driver pack that matches the operating system\nRacadm driverpack attach -i <index> -t <expose duration>\nNone\tTo detach the driver pack\nRacadm driverpack detach",
    "input": "-i—index of the operating system\n● -t—exposed time duration in seconds. It is an optional parameter and the default value is 64800\nseconds.",
    "output": "racadm driverpack getinfo—<OS name>\n● Racadm driverpack attach—Job Id details\n● Racadm driverpack detach—detach successful\nracadm driverpack getinfo—<OS name>\nRacadm driverpack attach—Job Id details\nRacadm driverpack detach—detach successful",
    "example": "To attach the driver pack with operating system index and exposed time\nracadm driverpack attach -i <OS Index> [-t <exposed time>]\n● To check the job status\nracadm jobqueue view -i JID_000000000000\n● To detach the operating system\nracadm driverpack detach"
  },
  "eventfilters ": {
    "description": "Displays the list of event filter settings. To use this subcommand with the set and test option, you must\nhave the Administrator privilege.",
    "syntax": "racadm eventfilters <eventfilters command type>\nracadm eventfilters get -c <alert category>\nracadm eventfilters set -c <alert category> -a <action> -n <notifications>\nracadm eventfilters set -c <alert category> -a <action> -r <recurrence>\nracadm eventfilters test -i <Message ID to test>\nNOTE: The general format of an alert category:\nidrac.alert.category.[subcategory].[severity]\nwhere category is mandatory, but subcategory and severity are optional. A severity cannot precede a\nsubcategory.\nValid Category values are:\n● All\n● System\n● Storage\n● Updates\n● Audit\n● Config\n● Worknotes\nDefinitions of the values are:\n● System Health—System Health category represents all the alerts that are related to hardware within\nthe system chassis. Examples include temperature errors, voltage errors, and device errors.\n● Storage Health—Storage Health category represents alerts that are related to the storage subsystem.",
    "example": "s include, controller errors, physical disk errors, and virtual disk errors.\n● Updates—Update category represents alerts that are generated when firmware/drivers are upgraded\nor downgraded.\nNOTE: This does not represent firmware inventory.\n● Audit—Audit category represents the audit log. Examples include, user login/logout information,\npassword authentication failures, session info, and power states.\n● Configuration—Configuration category represents alerts that are related to hardware, firmware, and\nsoftware configuration changes. Examples include, PCIe card added/removed, RAID configuration\nchanged, iDRAC license changed.\n● Work notes—Work notes represents an entry in the Lifecycle log. You can add a work note\nto the Lifecycle Log to record comments for your reference. You can enter comments such as\nscheduled downtime or changes that are made by administrators who work in different shifts for the\nlater reference.\nNOTE: idrac.all.all is not a valid sub category.\nValid Severity values are:\n● Critical\n● Warning\n● Info\nValid examples of alert queries are:\n● idrac.alert.all\n● idrac.alert.audit\n● idrac.alert.audit.lic\n● idrac.alert.audit.warning\n● idrac.alert.audit.lic.critical\nThis command does not support setting the proxy parameters if the share location (-l) is HTTP/HTTPS.\nFor more information, see Proxy parameter section.",
    "input": "get—Displays the list of eventfilter settings\n● set—Configures the actions and notifications for a given eventfilter configuration\n● -i—Message ID for which the simulation is needed\n● -c—Alert category of the specific event filter\n● -a—The action that must be invoked when the event occurs. Valid values are none, powercycle,\npower off, or systemreset\n● -n—The notification is sent when the event occurs. Valid values are all, snmp, ipmi, ws-events,\nredfish-events, oslog, email, remotesyslog, or none. You can append multiple notifications\nthat are separated by a comma. You cannot enter the values all or none with other notifications. If\nincorrect notification is specified along with other valid notifications, the valid and invalid notification\nset is failed.\n● -r—Event generation interval. This option is applicable only to the temperature statistics subcategory\ntmps. You can use this option as a stand-alone or with -n and -a.\nNOTE: If both event generation interval and notifications are configured and there is an error while\nconfiguring the notifications, the event generation interval is not set. The valid values are 0–365. 0\ndisables the event generation.\n● Configure using severity as a parameter. For example, all informational events in storage category are\nassigned power off as action, and email and SNMP as notifications.\nracadm eventfilters set -c idrac.alert.storage.info -a poweroff -n\nemail,snmp\n● Configure using subcategory as a parameter. For example, all configurations under the licensing\nsubcategory in the audit category are assigned power off as action and all notifications are enabled.\nracadm eventfilters set -c idrac.alert.audit.lic -a poweroff -n all\n● Configure using subcategory and severity as parameters. For example, all information events under the\nlicensing subcategory in the audit category are assigned power off as action and all notifications are\ndisabled:\nracadm eventfilters set -c idrac.alert.audit.lic.info -a poweroff -n\nnone\n● Configure the event generation interval for temperature statistics.\nracadm eventfilters set -c idrac.alert.system.tmps.warning -r 10\n● Configure the event generation interval and notifications for temperature statistics.\nracadm eventfilters set -c idrac.alert.system.tmps -r 5 -a none -n snmp\n● Send a test alert for the fan event.\nracadm eventfilters test -i FAN0001\n● To configure the proxy parameter.\nracadm set lifecyclecontroller.lcattributes.UserProxyUsername admin1\n● To remove the proxy parameter.\nracadm set lifecyclecontroller.lcattributes.UserProxyUsername\n● To view the list of proxy attributes.\nracadm get lifecycleController.lcAttributes"
  },
  "exposeisminstallertohost ": {
    "description": "Exposes the ISM installer to host OS",
    "syntax": "racadm exposeisminstallertohost",
    "input": "Not Applicable",
    "example": "Not Applicable"
  },
  "fcstatistics ": {
    "description": "Displays a list of FCs (FQDDs), managed server for which statistics is available.",
    "syntax": "racadm fcstatistics <FC fqdd>",
    "input": "<FC fqdd> — Specify the FQDD of the target FC device.",
    "example": "racadm fcstatistics <FC fqdd>"
  },
  "frontpanelerror ": {
    "description": "Enables or disables the live-feed of the errors currently being displayed on the LCD screen. For error\nacknowledge use hide, and error assert use show.",
    "syntax": "racadm frontpanelerror show\nracadm frontpanelerror hide",
    "input": "show — to view the errors currently being displayed on the LCD screen.\n● hide — to hide the errors currently being displayed on the LCD screen.",
    "example": "racadm frontpanelerror show\nFront Panel Error—Show Enabled.\n● racadm frontpanelerror hide\nFront Panel Error—Hide Enabled.\nracadm frontpanelerror show\nFront Panel Error—Show Enabled.\nracadm frontpanelerror hide\nFront Panel Error—Hide Enabled."
  },
  "fwupdate ": {
    "description": "Allows you to update the firmware. You can\n● Check the firmware update process status.\n● Update iDRAC firmware from FTP or TFTP server by providing an IP address and optional path.\n● Update iDRAC firmware from the local file system using Local and Remote RACADM.\n● Roll back to the standby firmware.\nTo use this subcommand, you must have Configure iDRAC permission.\nNOTE: This command is only for iDRAC firmware update. For any other firmware update like BIOS or\nDUPs, use Update subcommand.\nNOTE: If the iSM is exposed on the host server, you may see the Firmware update operation\nis already in progress error.",
    "syntax": "racadm fwupdate -s\nracadm fwupdate -g -u -a <TFTP_Server_IP_Address>\n[-d <path> [--clearcfg]\nracadm -r <iDRAC IP_Address> -u <username> -p <password> fwupdate -f\n<ftpserver ip> <ftpserver username> <ftpserver password> -d <path> where\npath is the location on the ftp server where firmimgFIT.d9 is stored.\nracadm fwupdate -r\nracadm fwupdate -p -u [-d <path>]\nNOTE: When attempting to run firmware update task, if the firmware image path length is greater than\n256 characters, remote RACADM client exits with the error message \"ERROR: Specified path\nis too long\".",
    "input": "—u—The update option performs a checksum of the firmware update file and starts the update\nprocess. This option may be used along with the —g or —p options. At the end of the update, iDRAC\nperforms a soft reset.\n● —s—This option returns the status of the update process.\n● -a—The -a option specifies TFTP server IP address that is used for firmware image. This option must\nbe used with the -g option.\n● --clearcfg—The -clearcfg option removes the previous iDRAC configuration after firmware\nupdate.\n● -g—The get option instructs the firmware to get the firmware update file from the TFTP server.\nSpecify the -a -u, and —d options. In the absence of the —a option, the defaults are read from\nproperties in the group cfgRemoteHosts, using properties cfgRhostsFwUpdateIpAddr and\ncfgRhostsFwUpdatePath.\n● -p—The -p, or put, option is used to update the firmware file from the managed system to iDRAC. The\n-u option must be used with the -p option.\n● Default: Designated TFTP default directory on that host for the file if -g option is absent. If -g is\nused, it defaults to a directory configured on the TFTP server.\nNOTE: The -p option is supported on local and remote RACADM and is not supported with the\nserial/ssh console and on the Linux operating systems.\nNOTE: The -p option is applicable for both remote and local RACADM proxy commands. However, this\noption is not supported for local RACADM running on Linux operating systems.\nNOTE: The filename for firmware update file must be firmimgFIT.d9.\n● -r—The rollback option is used to roll back to the standby firmware.",
    "output": "Displays a message indicating the operation that is being performed.\n● Query the current status of the firmware update process:\nracadm fwupdate -s\n● Rollback to the standby firmware:\nracadm fwupdate -r\n● Upload firmware image from TFTP server, start firmware update. After firmware update is complete,\ndelete previous iDRAC configuration:\nracadm fwupdate -g -u -a 192.168.0.100 -d /tmp/images --clearcfg\nNOTE: Firmware update from local RACADM (using -p -u -d options) is not supported on Linux\noperating system.\nFW Update Method\tiDRAC on Blade Servers\tiDRAC on Rack and Tower Servers\nLocal RACADM\tYes\tYes\nLocal RACADM-TFTP\tYes\tYes\nLocal RACADM-FTP\tYes\tYes\nRemote RACADM\tYes\tYes\nRemote RACADM-TFTP\tYes\tYes\nRemote RACADM-FTP\tYes\tYes\nFirmware RACADM-TFTP\tYes\tYes\nFirmware RACADM-FTP\tYes\tYes"
  },
  "gethostnetworkinterfaces ": {
    "description": "Broadcom NetXtreme Gigabit Ethernet\nStatus : Up\nInterface Type : Ethernet\nDHCP : Enabled\nDHCPServerV4 : 10.94.224.25\nMAC Address : 14-FE-B5-FF-B1-9C\nFQDD : NIC.Integrated.1-1-1\nIPv4 Address : 10.94.225.189\nSubnet Mask : 255.255.255.128\nIPv6 Address : fe80::7c5f:a114:84d4:17f6\nPrefix Length : 64\nIPv4 Gateway Address : 10.94.225.129\nIPv4 DNSServer Address 0: 10.116.2.250\nIPv4 DNSServer Address 1: 10.116.2.251",
    "syntax": "racadm gethostnetworkinterfaces\nracadm gethostnetworkinterfaces <NIC FQDD>\nMAC Address : 00-25-64-F9-7A-E7\nIPv4 Address : 169.254.0.2\nSubnet Mask : 255.255.255.0\nIPv6 Address : fe80::1cce:a0a7:f30e:54fc\nPrefix Length : 64\nIPv6 DNSServer Address 0: fec0:0:0:ffff::1\nIPv6 DNSServer Address 1: fec0:0:0:ffff::2\nIPv6 DNSServer Address 2: fec0:0:0:ffff::3\n● To display the details of a particular NIC on the server.\nracadm gethostnetworkinterfaces NIC.Integrated.1-1-1\nLocal Area Connection"
  },
  "getled ": {
    "description": "Displays the LED settings on a module: blinking, not blinking, or unknown (for empty slots). To run this\nsubcommand, you must have the Login User privilege.",
    "syntax": "racadm getled",
    "output": "LED is blinking\n● LED is not-blinking",
    "example": "racadm getled\nLED State : Blinking\nracadm getled\nLED State : Not-Blinking"
  },
  "getmetrics ": {
    "description": "The getmetrics command is used to display utilization of GPU devices such as GPU Utilization, Memory\nUtilization, Graphics Clock frequency and Memory clock frequency.",
    "syntax": "racadm getmetrics <FQDD>",
    "input": "<FQDD>— FQDD of GPU device",
    "example": "To display the utilization of GPU devices\nracadm getmetrics Video.Slot.1-1"
  },
  "getniccfg ": {
    "description": "Displays the current and static NIC settings for iDRAC.",
    "syntax": "racadm getniccfg",
    "output": "The getniccfg subcommand displays an appropriate error message if the operation is not successful.\nOtherwise, the output is displayed in the following format: The following provides the details of IPV4\nsettings:\nIPv4 settings:\nNIC Enabled =1\nIPv4 Enabled =1\nDHCP Enabled =0\nIP Address =10.94.227.207\nSubnet Mask =255.255.255.0\nGateway =10.94.227.1\nIPv6 settings:\nIPv6 Enabled =Enabled\nDHCP6 Enabled =Enabled\nIP Address 1 =::\nGateway =::\nLink Local Address =::\nIP Address 2 =::\nIP Address 3 =::\nIP Address 4 =::\nIP Address 5 =::\nIP Address 6 =::\nIP Address 7 =::\nIP Address 8 =::\nIP Address 9 =::\nIP Address 10 =::\nIP Address 11 =::\nIP Address 12 =::\nIP Address 13 =::\nIP Address 14 =::\nIP Address 15 =::\nLOM Status:\nNIC Selection =dedicated\nLink Detected =Yes\nSpeed =1Gb/s\nDuplex Mode =Full Duplex\nActive NIC =Dedicated\nStatic IPv4 settings:\nStatic IP Address =10.94.227.207\nStatic Subnet Mask =255.255.255.0\nStatic Gateway =10.94.227.1\nStatic IPv6 settings:\nStatic IP Address 1 =::\nStatic Prefix Length =64\nStatic Gateway =::\nNOTE: IPv6 information is displayed only if IPv6 is enabled in iDRAC.\nNOTE: IPv6 Address 1 field indicates static IP and IPv6 Address 2 field indicates dynamic IP.\nNOTE: LOM Status is displayed only for iDRAC on Rack and Tower servers and is not displayed for\niDRAC Enterprise on Blade servers.",
    "example": "Display iDRAC network settings in server slot 1\nracadm getniccfg"
  },
  "getraclog ": {
    "description": "The getraclog command displays RAC log entries.",
    "syntax": "racadm getraclog [-i]\n● racadm getraclog [-s <start>] [-c <count>]\nracadm getraclog [-c <count>] [-s <start-record>]\nNOTE: If options are not provided, the entire log is displayed.",
    "input": "-c — Specifies the number of records to display.\nNOTE: On Local RACADM, the number of logs are restricted to 100 by default.\n● -s — Specifies the starting record used for the display.\nNOTE: When Enhanced Chassis Logging and Events feature is enabled, then -i and --more options are\nnot displayed.",
    "output": "SeqNumber = 286\nMessage ID = USR0005\nCategory = Audit\nAgentID = RACLOG\nSeverity = Information\nTimestamp = 2017-05-15 06:25:27\nMessage = Login failed from processdisco06a: 192.168.0\nMessage Arg 1 = processdisco06a\nMessage Arg 2 = 10.92.68.245\nFQDD = iDRAC.Embedded.1\nracadm getraclog [-i]\nracadm getraclog [-s <start>] [-c <count>]\nMessage = License yPMRJGuEf7z5HG8LO7gh assigned to device iDRAC expires\nin 4 days.\nMessage Arg 1 = yPMRJGuEf7z5HG8LO7ghMessage Arg 2 = iDRACMessage Arg 3 = 4\n--------------------------------------------------------------------------\n---------\nSeqNumber = 4101\nMessage ID = USR0032\nCategory = Audit\nAgentID = RACLOG\nSeverity = Information\nTimestamp = 2017-05-15 06:25:27\nMessage = The session for root from 192.168.0 using RACADM is logged off.\nMessage Arg 1 = root\nMessage Arg 2 = 10.94.98.92\nMessage Arg 3 = RACADM\nFQDD = iDRAC.Embedded.1\n--------------------------------------------------------------------------\n-----------"
  },
  "getractime ": {
    "description": "Displays the current iDRAC time.",
    "syntax": "racadm getractime [-d]",
    "input": "-d — Displays the time in the format, YYYYMMDDhhmmss.",
    "output": "The current iDRAC time is displayed.",
    "example": "racadm getractime\nMon May 13 17:17:12 2013\n● racadm getractime -d\n20141126114423\nracadm getractime\nMon May 13 17:17:12 2013\nracadm getractime -d\n20141126114423"
  },
  "getremoteservicesstatus ": {
    "description": "Displays the status of a system.",
    "syntax": "racadm getremoteservicesstatus",
    "input": "racadm getremoteservicesstatus\nNone\tPossible values for the host system status\n● Powered Off\n● In POST\n● Out of POST\n● Collecting System Inventory\n● Automated Task Execution\n● Lifecycle Controller Unified Server Configurator\n● Server has halted at F1/F2 error prompt because of a POST error\n● Server has halted at F1/F2/F11 prompt because there are no bootable devices available\n● Server has entered F2 setup menu\n● Server has entered F11 Boot Manager menu\nPossible values for the for Lifecycle controller(LC) status\n● Ready\n● Not Initialized\n● Reloading data\n● Disabled\n● In Recovery\n● In Use\nPossible values for the real time status\n● Ready\n● Not ready\n● Not Applicable\nNOTE: The real time status is displayed as Not Applicable if there are no real time capable\ncontrollers present on the system.\nPossible values for the overall status\n● Ready\n● Not ready\nPossible values for the Telemetry status\n● Ready\n● Not ready",
    "example": "racadm getremoteservicesstatus"
  },
  "getsel ": {
    "description": "Displays all system event log (SEL) entries in iDRAC.",
    "syntax": "racadm getsel [-i]\n● racadm getsel [-s <start>][-c <count>]\nNOTE: If no arguments are specified, the entire log is displayed.",
    "input": "—i — Displays the number of entries in the SEL.\n● -s — Displays the starting record number.\n● -c — Specifies the number of records to display.\n● --more — Displays a screen.\nNOTE: Press Q to exit from the screen.\n● -A — Does not display headers or labels.\n● -o — Displays each record on a single line..\n● -E — Displays RAW SEL data along with the other data.\n● -R — Displays only the RAW SEL data for each record",
    "example": "Display entire log.\nracadm getsel\n● Display number of records in log.\nracadm getsel -i"
  },
  "getsensorinfo ": {
    "description": "Displays the status for system sensors.\nNOTE: For the Dell PowerEdge FX2 chassis with the FM120x4 server, the power-related information is\nnot displayed.",
    "syntax": "racadm getsensorinfo\n● racadm getsensorinfo -c",
    "input": "-c—Compact output format.\nracadm getsensorinfo\nracadm getsensorinfo -c\n<Sensor Name>\t<Status>\t<Type>\t<Input Power>\nPS1 Status\tPresent\tAC\tWatts\nPS2 Status\tAC-Lost\tAC\tWatts\n<Sensor\nName>\t<Status>\t<Reading>\t<lc>\t<uc>\t<Inc>[R/W]\t<Unc>[R/W]\nSystem\nBoard Inlet\nTemp\tOk\t20 C\t-7 C\t47 C\t3 C [Y]\t42C [Y]\nSystem\nBoard\nExhaust\nTemp\tOk\t19 C\t0 C\t75 C\t0 C [N]\t70 C [N]\nCPU1 Temp\tOk\t59 C\t3 C\t97 C\t8 C [N]\t92 C [N]\n<Sensor Name>\t<Status>\t<Reading>\t<lc>\t<uc>\t<PWM %>\nSystem Board\nFan1 RPM\tOk\t5880 RPM\t600 RPM\tNA\t21%\nSystem Board\nFan2 RPM\tOk\t6000 RPM\t600 RPM\tNA\t0%\nSystem Board\nFan3 RPM\tOk\t5880 RPM\t600 RPM\tNA\t0%\n<Sensor Name>\t<Status>\t<Reading>\t<lc>\t<uc>\t<PWM %>\nSystem Board\nFan4 RPM\tOk\t5880 RPM\t600 RPM\tNA\t0%\nSystem Board\nFan5 RPM\tOk\t5640 RPM\t600 RPM\tNA\t144%\nSystem Board\nFan6 RPM\tOk\t5880 RPM\t600 RPM\tNA\t152%\n<Sensor Name>\t<Status>\t<Reading>\t<lc>\t<uc>\nCPU1 VCORE PG\tOk\tGood\tNA\tNA\nSystem Board 3.3V\nPG\tOk\tGood\tNA\tNA\nSystem Board 5V\nAUX PG\tOk\tGood\tNA\tNA\nCPU1 M23 VPP PG\tOk\tGood\tNA\tNA\nSystem Board\n1.05V PG\tOk\tGood\tNA\tNA\nCPU1 M23 VDDQ PG\tOk\tGood\tNA\tNA\nCPU1 M23 VTT PG\tOk\tGood\tNA\tNA\nSystem Board 5V\nSWITCH PG\tOk\tGood\tNA\tNA\nSystem Board\nVCCIO PG\tOk\tGood\tNA\tNA\nSystem Board 2.5V\nAUX PG\tOk\tGood\tNA\tNA\nPS1 Voltage 1\tOk\t-28.00V\tNA\tNA\nPS1 Voltage 2\tOk\t0.00V\tNA\tNA\nCPU1 M01 VDDQ PG\tOk\tGood\tNA\tNA\nSystem Board NDC\nPG\tOk\tGood\tNA\tNA\nCPU1 M01 VPP PG\tOk\tGood\tNA\tNA\nSystem Board 1.5V\nPG\tOk\tGood\tNA\tNA\nSystem Board PS2\nPG Fail\tOk\tGood\tNA\tNA\nSystem Board PS1\nPG Fail\tOk\tGood\tNA\tNA\nSystem Board 1.5V\nAUX PG\tOk\tGood\tNA\tNA\nCPU1 M01 VTT PG\tOk\tGood\tNA\tNA\nPS1 Voltage 1\tOk\t240 V\tNA\tNA\n<Sensor Name>\t<Status>\t<Reading>\t<lc>\t<uc>\nSystem Board DIMM\nPG\tOk\tGood\tNA\tNA\n<Sensor\nName>\t<Status>\t<Reading>\t<lc>\t<uc>\t<Inc> [R/W]\t<unc> [R/W]\nPS1 Current\n1\tOk\t0.4 Amps\tNA\tNA\t0 Amps [N]\t0 Amps [N]\nSystem\nBoard Pwr\nConsumption\tOk\t56 Watts\tNA\t1386 Watts\t0 Watts [N]\t1260 Watts\n[N]\n<Sensor Name>\t<Status>\t<State>\t<lc>\t<uc>\nCPU1 Status\tOk\tPresence Detected\tNA\tNA\nCPU2 Status\tN/A\tAbsent\tNA\tNA\n<Sensor Name>\t<Status>\t<State>\t<lc>\t<uc>\nDIMM A1\tN/A\tPresence Detected\tNA\tNA\nDIMM A2\tN/A\tAbsent\tNA\tNA\nDIMM A3\tOk\tAbsent\tNA\tNA\nDIMM A4\tN/A\tAbsent\tNA\tNA\nDIMM A5\tN/A\tAbsent\tNA\tNA\nDIMM A6\tN/A\tAbsent\tNA\tNA\nDIMM A7\tN/A\tAbsent\tNA\tNA\nDIMM A8\tN/A\tAbsent\tNA\tNA\nDIMM A9\tN/A\tAbsent\tNA\tNA\nDIMM A10\tN/A\tAbsent\tNA\tNA\nDIMM A11\tN/A\tAbsent\tNA\tNA\nDIMM A12\tN/A\tAbsent\tNA\tNA\nDIMM B1\tN/A\tAbsent\tNA\tNA\nDIMM B2\tN/A\tAbsent\tNA\tNA\nDIMM B3\tN/A\tAbsent\tNA\tNA\nDIMM B4\tN/A\tAbsent\tNA\tNA\nDIMM B5\tN/A\tAbsent\tNA\tNA\n<Sensor Name>\t<Status>\t<State>\t<lc>\t<uc>\nDIMM B6\tN/A\tAbsent\tNA\tNA\nDIMM B7\tN/A\tAbsent\tNA\tNA\nDIMM B8\tN/A\tAbsent\tNA\tNA\nDIMM B9\tN/A\tAbsent\tNA\tNA\nDIMM B10\tN/A\tAbsent\tNA\tNA\nDIMM B11\tN/A\tAbsent\tNA\tNA\nDIMM B12\tN/A\tAbsent\tNA\tNA\n<Sensor Name>\t<Status>\t<State>\nChassis Controller\tOK\tOK\n<Sensor Name>\t<Status>\t<Reading>\t<lc>\t<uc>\nSystem Board CMOS\nBattery\tOk\tPresent\tNA\tNA\nPERC1 ROMB\nBattery\tOk\tUnknown\tNA\tNA\nPERC2 ROMB\nBattery\tOk\tUnknown\tNA\tNA\n<Sensor Name>\t<Status>\t<Status>\t<lc>\t<uc>\nSystem Board\nPower Optimized\tOk\tNot Degraded\tNA\tNA\n<Sensor Name>\t<Intrusion>\t<Status>\nSystem Board Intrusion\tClosed\tPower ON\n<Sensor Name>\t<Status>\t<Type>\nSystem Board Fan Redundancy\tFull Redundant\tFan\n<Sensor Name>\t<Status>\t<Type>\nSystem Board PS Redundancy\tDisabled\tPSU\n<Sensor\nName>\t<Status>\t<Reading>\t<lc>\t<uc>\t<Inc> [R/W]\t<unc> [R/W]\nSystem\nBoard CPU\nUsage\tNon-\nCritical\t0%\t0%\t100%\t0% [N]\t99% [Y]\nSystem\nBoard IO\nUsage\tNon-\nCritical\t0%\t0%\t100%\t0% [N]\t99% [Y]\nSystem\nBoard MEM\nUsage\tNon-\nCritical\t0%\t0%\t100%\t0% [N]\t99% [Y]\nSystem\nBoard SYS\nUsage\tNon-\nCritical\t0%\t0%\t100%\t0% [N]\t99% [Y]\n<Sensor Name>\t<PwrConsumption>\t<PwrSupplyStatus>\t<BoardPwrSupplyStatus>\nVideo.Slot.1\t4.3MW\tEnabled\tDisabled\nVideo.Slot.3\t4.3MW\tEnabled\tDisabled\nVideo.Slot.5\t4.3MW\tEnabled\tDisabled\nVideo.Slot.4\t4.3MW\tEnabled\tDisabled\nVideo.Slot.8\t4.3MW\tEnabled\tDisabled\n<Sensor Name>\t<GPU\nTemperature>\t<SecondaryGPUT\nemp>\t<BoardTemp>\t<MemoryTemp>\nVideo.Slot.1\t29C\t255C\t255C\t255C\nVideo.Slot.3\t56C\t255C\t255C\t255C\nVideo.Slot.5\t57C\t255C\t255C\t255C\nVideo.Slot.4\t32C\t255C\t255C\t255C\nVideo.Slot.8\t30C\t255C\t255C\t255C\n<Sensor\nName>\t<GPU\nTarget\nTemp>\t<MinGPUH\nwSlowdow\nnTemp>\t<GPUShutdow\nnTemp>\t<MaxMemoryO\nperatingTem\np>\t<MaxGPUOper\natingTemp>\t<ThermalAle\nrtStatus>\t<PowerBrake\nStatus>\nVideo.Sl\not.1\t255C\t255C\t255C\t255C\t255C\tDisabled\tDisabled\nVideo.Sl\not.3\t255C\t255C\t255C\t255C\t255C\tDisabled\tDisabled\nVideo.Sl\not.5\t255C\t255C\t255C\t255C\t255C\tDisabled\tDisabled\n<Sensor\nName>\t<GPU\nTarget\nTemp>\t<MinGPUH\nwSlowdow\nnTemp>\t<GPUShutdow\nnTemp>\t<MaxMemoryO\nperatingTem\np>\t<MaxGPUOper\natingTemp>\t<ThermalAle\nrtStatus>\t<PowerBrake\nStatus>\nVideo.Sl\not.4\t255C\t255C\t255C\t255C\t255C\tDisabled\tDisabled\nVideo.Sl\not.8\t255C\t255C\t255C\t255C\t255C\tDisabled\tDisabled\nSensor Name\tReading\nMax DIMM Temperature\t24.000\nSensor Name\tReading\nTemp Sensor.1\t51.0C\nSensor Name\tReading\nPower Sensor.2\t26.0W"
  },
  "getssninfo ": {
    "description": "Displays a list of users that are connected to iDRAC. The following information is displayed\n● Session ID\n● Username\n● IP address (if applicable)\n● Session type\n● Login date and time in MM/DD/YYYY HH:MM:SS format\nNOTE: Based on the Session ID (SSNID) or the user name (User), the iDRAC administrator can\nclose the respective sessions or all the sessions using the closessn subcommand. For more\ninformation, see closessn.",
    "syntax": "racadm getssninfo [-u <username>] [-A]",
    "input": "-u — displays only sessions associated with a specific user.\n● -A — does not display headers or labels.\nSSNID\tType\tUser\tIP Address\tLogin Date/Time\n58999\tSSH\troot\t192.168.0.10\t04/07/2016 12:00:34"
  },
  "getsvctag ": {
    "description": "Displays the service tag of the host system.",
    "syntax": "racadm getsvctag",
    "output": "Any system tag as applicable.",
    "example": "Display the service tag of the host system.\nracadm getsvctag"
  },
  "getsysinfo ": {
    "description": "Displays information related to iDRAC, managed system, and watchdog configuration.\nNOTE: The hostname and OS Name fields in the getsysinfo output display accurate information\nonly if the OpenManage Server Administrator (OMSA) is installed on the managed system. If OMSA\nis not installed these fields may be blank or inaccurate. An exception to this are the VMware and\nWindows operating system names, which are displayed even if OMSA is not installed on the managed\nsystem.",
    "syntax": "racadm getsysinfo [-d] [-A] [-c] [-4] [-6]",
    "input": "—4—Displays IPv4 settings\n● —6—Displays IPv6 settings\n● —c—Displays common settings\n● —d—Displays iDRAC information\n● —A—Eliminates the printing of headers or labels"
  },
  "gettracelog ": {
    "description": "Lists all the trace login entries of iDRAC.",
    "syntax": "racadm gettracelog [-i]\n● racadm gettracelog [-s <start>] [-c <count>]",
    "input": "—i — Displays the number of entries in iDRAC trace log.\n● -c — Specifies the number of records to display.\n● -s — Specifies the starting record to display.",
    "output": "The default output display shows the record number, timestamp, source and description. The timestamp\nbegins at midnight, January 1 and increases until the system starts. After the system starts, the system’s\ntimestamp is used.",
    "example": "Display entire log\nracadm gettracelog\n● Display number of records in log\nracadm gettracelog -i\nTotal Records: 228\nracadm gettracelog [-i]\nracadm gettracelog [-s <start>] [-c <count>]"
  },
  "getversion ": {
    "description": "Displays the current software version, model and generation information, and whether the target device\ncan be updated.",
    "syntax": "racadm getversion\n● racadm getversion [-b | -c | —i]\n● racadm getversion [-f <filter>]",
    "input": "-c — Displays the server's current CPLD version.\n● -b — Displays the server's current BIOS version.\n● -i — Displays the server's current IDSDM version.\n● -f <filter> — Filters the components and must be one of the following values:\n○ bios: BIOS\n○ idrac: iDRAC\n○ lc: Lifecycle Controller\n○ idsdm: SD card\n<Server>\t<CPLD Version>\t<Blade Type>\nserver-1\t1.0.5\tPowerEdgeM520\nserver-2\t1.0.3\tPowerEdgeM610x\nserver-4\t1.0.0\tPowerEdgeM710HD\nserver-5\t1.0.3\tPowerEdgeM710\nserver-7\t1.0.6\tPowerEdgeM620\nserver-9\t1.0.5\tPowerEdgeM520\n<Server>\t<BIOS Version>\t<Blade Type>\nserver-1\t1.6.0\tPowerEdgeM520\nserver-2\t6.3.0\tPowerEdgeM610x\nserver-4\t7.0.0\tPowerEdgeM710HD\nserver-5\t6.3.0\tPowerEdgeM710\nserver-7\t1.7.1\tPowerEdgeM620\n<Server>\t<BIOS Version>\t<Blade Type>\nserver-9\t1.7.1\tPowerEdgeM520\n<Switch>\t<Model Name>\t<HW Version>\t<FW Version>\nswitch-1\tMXL 10/40GbE\tX01\t9-2(0-296)\nswitch-2\tM8024-k 10GbE SW\tA00\t5.0.1.3\nswitch-3\tDell PowerConnect\nM8024\tX00\tNot applicable\nswitch-4\tDell PowerConnect\nM8024\tX00\tNot applicable\nswitch-5\tDell PowerConnect\nM6348\tX02\tNot applicable\nswitch-6\tDell PowerConnect\nM6220\tA01\tNot applicable"
  },
  "groupmanager ": {
    "description": "Allows you to\n● Delete the group from the group manager.\n● Remove the iDRAC from group by itself by using admin privileges.\n● Join the group using administrator privileges.\nNOTE: This subcommand is supported only on iDRAC9.",
    "syntax": "To delete the group from the group manager.\ngroupmanager delete –g <groupname>\n● To remove the iDRAC from group by itself by using administrator privileges.\ngroupmanager removeself –g <groupname>\n● To join the group using administrator privileges.\ngroupmanager joingroup -g <groupname> -uid <uuid> -pcode <\ngrouppasscode>",
    "input": "-g— Specifies the name of the iDRAC member group\n● -uid — Specifies the group user id\n● -pcode— Specifies the group passcode",
    "example": "To delete the group from the groupmanager\nracadm groupmanager delete –g <groupname>\n● To remove the iDRAC from the group by itself:\nracadm groupmanager removeself –g <groupname>\n● To join server to the local iDRAC group:\nracadm groupmanager joingroup -g <mygrpxyz> -uid <uid1234> -pcode\n<12345>"
  },
  "httpsbootcert ": {
    "description": "Allows you to manage BIOS https Boot Certificate Management operations.",
    "syntax": "To import the bios https Boot Certificate from a remote share or local system\nracadm httpsbootcert help import\n● To export the bios https boot Certificate to a remote share or local system\nracadm httpsbootcert help export\n● To delete the bios https boot certificate\nracadm httpsbootcert help delete",
    "input": "-i—Index of the boot device 1 to 4\n● -f—Filename of the bios https Boot Device Certificate\n● -l—Network share location <CIFS/NFS/HTTP/HTTPS share>\n● -u—Username for the remote share\n● -p—Password for the remote share\nNOTE: The supported file formats are .cer,.der,.crt,.pem and .txt.\nNOTE: This command supports both IPV4 and IPV6 formats. IPV6 is applicable for CIFS and NFS\ntype remote shares.\n● To import the boot device cert with index 2 from a remote HTTPS share:\nracadm httpsbootcert import -i 2 -f httpsboot_cert.pem -l https://\n192.168.10.24/share -u myuser -p mypass\n● To iImport the boot device cert with index 3 from a local share using local racadm:\nracadm httpsbootcert import -f httpsboot_cert.crt\n● To import the boot device cert with index 4 from a local share using remote racadm:\nracadm -r 10.94.161.119 -u root -p calvin httpsbootcert import -f\nhttpsboot_cert.txt\n● To export the boot device cert with index 1 to a remote CIFS share:\nracadm httpsbootcert export -i 1 -f httpsboot_cert.txt -l //\n10.94.161.103/share -u admin -p mypass\n● To export the boot device cert with index 2 to a remote NFS share:\nracadm httpsbootcert export -i 2 -f httpsboot_cert.cer -l\n192.168.2.14:/share\n● To export the boot device cert with index 2 to a remote HTTP share:\nracadm httpsbootcert export -i 2 -f httpsboot_cert.der -l http://\n192.168.10.24/share -u myuser -p mypass\n● To export the boot device cert with index 2 to a remote HTTPS share:\nracadm httpsbootcert export -i 2 -f httpsboot_cert.crt -l https://\n192.168.10.24/share -u myuser -p mypass\n● To export the boot device cert with index 3 to local share using local racadm:\nracadm httpsbootcert export -f httpsboot_cert.pem\n● To export the boot device cert with index 4 to a local share using remote racadm:\nracadm -r 10.94.161.119 -u root -p calvin httpsbootcert export -f\nhttpsboot_cert.txt\nNOTE: These commands do not support setting the proxy parameters if the share location\nis HTTP/HTTPS. To perform the operation with HTTP or HTTPS via a proxy, the proxy\nparameters must be first configured using the lifecyclecontroller.lcattributes group.\nOnce these proxy parameters are configured, they become the part of default configuration.\nThe proxy attributes should be cleared to end use of the HTTP/HTTPS proxy. The valid\nlifecyclecontroller.lcattributes HTTP/HTTPS proxy parameters are:\n● UserProxyUserName\n● UserProxyPassword\n● UserProxyServer\n● UserProxyPort\n● UserProxyType\nTo view the list of proxy attributes, use racadm get lifecycleController.lcAttributes.\n● To delete the boot device cert with index 1:\nracadm httpsbootcert delete -i 1\n● To delete the boot device cert with index 2:\nracadm httpsbootcert delete -i 2"
  },
  "hwinventory ": {
    "description": "Allows you to display or export current internal hardware inventory or shipped hardware inventory by\ndevice.\nNOTE: iDRAC supports a maximum of 12 parallel sessions of hardware inventory.",
    "syntax": "racadm hwinventory\n● racadm hwinventory networktransceiver\n● racadm hwinventory NIC|FC|Infiniband\n● racadm hwinventory <FQDD>\n● racadm hwinventory export -f <filename> -u <username> -p <password> -l\n<CIFS or NFS share>\n● racadm hwinventory export -f <filename> -u <username> -p <password> -l\n<HTTP or HTTPS share> -port <port number>",
    "input": "<FQDD> — Specifies the FQDD of the target device.\n○ FQDD — NIC.Slot.1–2\nNOTE: The hwinventory subcommand supports NIC, Infiniband and FC FQDDs only.\n● -f — Exported Hardware Inventory filename.\n● -u — Username of the remote share to where the file must be exported. Specify user name in a\ndomain as domain/username\n● -p — Password for the remote share to where the file must be exported.\n● -l — Network share location to where the Hardware Inventory must be exported.\n● -port — Specifies the port number.\nNOTE: This is an optional parameter. If this option is not specified, the default port number is\nused."
  },
  "ifconfig ": {
    "description": "Displays the contents of the network interface table. To use this subcommand, you must have the Execute\nDiagnostic Commands permission.",
    "syntax": "racadm ifconfig",
    "input": "N/A"
  },
  "Example ": {},
  "ilkm ": {
    "description": "The ilkm subcommand allows you to enable or disable ilkm support for a server, and rekey ilkm-supported\ndevices on a server. To run this subcommand, you must have the following privileges:\n● Enable—server control and configure iDRAC privileges\n● Disable—server control and configure iDRAC privileges\n● Rekey—server control and configure iDRAC privileges\n● Getstatus—login privileges",
    "syntax": "NOTE: To run enable or disable subcommands, the target server must have sekm license.\n● To get ilkm status.\nracadm ilkm getstatus\n● To enable ilkm feature.\nracadm ilkm enable -keyid <keyID> -passphrase <password>\n● To disable ilkm feature.\nracadm ilkm disable\n● To request iDRAC to rekey all ilkm devices.\nracadm ilkm rekey -oldpassphrase <password> -newkeyid <keyID>\n-newpassphrase <password>",
    "input": "-keyid—Key Identifier\n● -passphrase—Password\n● -oldpassphrase—Old Password\n● -newkeyid—New Key ID\n● -newpassphrase—New Password",
    "example": "To get ilkm status.\nracadm ilkm getstatus\n● To enable ilkm feature.\nracadm ilkm enable -keyid keyID -passphrase password\n● To disable ilkm feature.\nracadm ilkm disable\n● To request iDRAC to rekey all ilkm devices.\nracadm ilkm rekey -oldpassphrase password -newkeyid keyID\n-newpassphrase pasword"
  },
  "infinibandstatistics ": {
    "description": "Displays the list of InfiniBand devices managed by the server for which statistics are available.",
    "syntax": "racadm infinibandstatistics <Infiniband FQDD>",
    "input": "<Infiniband FQDD> — The fully qualified device descriptor of the device.\nNOTE: Partition Driver State and Partition OS Driver State properties are the same\nfor infinibandstatistics.\n1 Partition 1\nPort Transmit Data: 0\nPort Receive Data: 0\nPort Transmit Packets: 0\nPort Receive Packets: 0\nPort Transmit Wait: 0\nPort Transmit Discard: 0\nSymbol Error Count: 0\nLink Error Recovery Count: 0\nLink Downed Count: 0\nPort Receive Errors: 0\nPort Receive Remote Physical Errors: 0\nPort Receive Switch Relay Errors: 0\nLocal Link Integrity Errors: 0\nExcessive Buffer Overrun: 0\nVL15 Dropped: 0\nTotal Bytes Received: Not Applicable\nTotal Bytes Transmitted: Not Applicable\nTotal Unicast Bytes Received: Not Applicable\nTotal Multicast Bytes Received: Not Applicable\nTotal Broadcast Bytes Received: Not Applicable\nTotal Unicast Bytes Transmitted: Not Applicable\nTotal Multicast Bytes Transmitted: Not Applicable\nTotal Broadcast Bytes Transmitted: Not Applicable\nFCS Error Packets Received: Not Applicable\nAlignment Error Packets Received: Not Applicable\nFalse Carrier Error Packets Received: Not Applicable\nRunt Frames Received: Not Applicable\nJabber Error Frames Received: Not Applicable\nTotal Pause XON Frames Received: Not Applicable\nTotal Pause XOFF Frames Received: Not Applicable\nDiscarded Packets: 0\nTotal Pause XON Frames Transmitted: Not Applicable\nTotal Pause XOFF Frames Transmitted: Not Applicable\nSingle Collision Frames Transmitted: Not Applicable\nMultiple Collision Frames Transmitted: Not Applicable\nLate Collision Frames Transmitted: Not Applicable\nExcessive Collision Frames Transmitted: Not Applicable\nLink Status: Down\nLink Width: Not Available\nLink Speed: Not Available\nPartition Link Status: Up\nPartition Driver State: Operational\nNOTE: When Port, Partition or RDMA statistics are not available, the output displays No Port/\nPartition/RDMA Statistics found for FQDD <Infiniband FQDD>."
  },
  "inlettemphistory ": {
    "description": "Displays the average and the peak temperatures during the last hour, day, week, month, or year. Also\nExports the inlet temperature history data file. The file can be exported to a remote file share, local file\nsystem, or the management station.\nNOTE: For FM120x4 systems, this subcommand provides the historical data for system board\ntemperature.",
    "syntax": "racadm inlettemphistory get\nracadm inlettemphistory export -f <Filename> -u <username> -p\n<password>\\\n-l <location> -t <export file type>\nracadm -r <idrac ip> -u <idrac username> -p <idrac password>\ninlettemphistory\\\nexport -f <Filename> -u <username> -p <password> -l <location> -t\n<export file type>\n●\nThis command does not support setting the proxy parameters if the share location (-l) is HTTP/HTTPS.\nTo perform the operation with HTTP or HTTPS through a proxy, the proxy parameters must be first\nconfigured using the lifecyclecontroller.lcattributes. Once these proxy parameters are configured, they\nbecome the part of default configuration; the proxy attributes should be cleared to end use of the HTTP/\nHTTPS proxy. The valid lifecyclecontroller.lcattributes HTTP/HTTPS proxy parameters are:\n● UserProxyUserName\n● UserProxyPassword\n● UserProxyServer\n● UserProxyPort\n● UserProxyType\nTo view the list of proxy attributes, use racadm get lifecycleController.lcAttributes.",
    "input": "-f — Exports inlet temperature history filename. The maximum length of this parameter is 64\ncharacters.\nNOTE: If a file with the specified filename exists, then the older file is replaced with the new history\nfile.\n● -u — User name of the remote share to export the file. Specify user name in a domain as domain or\nusername.\n● -p — Password for the remote share to where the file must be exported.\n● -l — Network share location to where the inlet temperature history must be exported. The maximum\nlength of this parameter is 256 characters.\nNOTE: The supported network locations are CIFS, NFS, HTTP, and HTTPS.\n● -t — Specifies the exported file type. Valid values are xml and csv. These values are case-insensitive.\nNOTE: From firmware RACADM, only export to a remote share is supported. The behavior of remote\nshare is not defined when the path specified (-l) contains special characters.\nNOTE: This command supports both IPV4 and IPV6 formats. IPV6 is applicable for CIFS and NFS type\nremote shares.\n● Export the log to a remote FTP share.\nracadm inlettemphistory export -f Mylog.csv -u ftpuser -p ftppwd -l\nftp://test.com/share -t csv\n● Export the log to a remote TFTP share.\nracadm inlettemphistory export -f Mylog.csv -l tftp://test.com/share -t\ncsv\n● Export the log to local file system using Local RACADM.\nracadm inlettemphistory export -f Mylog.xml -t xml\n● Export the log to management station using Remote RACADM.\nracadm -r 1.2.3.4 -u user -p xxx inlettemphistory export -f Mylog.csv\n-t csv\n● View the inlet temperature history.\nracadm inlettemphistory get\nDuration Above Warning Threshold as Percentage = 0.0%\nDuration Above Critical Threshold as Percentage = 0.0%\nAverage Temperatures\nLast Hour = 23C ( 73.4F )\nLast Day = 24C ( 75.2F )\nLast Week = 24C ( 77.0F )\nLast Month = 25C ( 77.0F )\nLast Year = 23C ( 73.4F )\nPeak Temperatures\nLast Hour = 23C ( 73.4F ) [At Wed, 21 May 2017 11:00:57]\nLast Day = 25C ( 77.0F ) [At Tue, 21 May 2017 15:37:23]\nLast Week = 27C ( 80.6F ) [At Fri, 20 May 2017 10:38:20]\nLast Month = 29C ( 84.2F ) [At Wed, 16 May 2017 15:34:13]\nLast Year = 29C ( 84.2F ) [At Wed, 16 May 2017 15:34:13]\n● Configure the proxy parameter.\nracadm set lifecyclecontroller.lcattributes.UserProxyUsername admin1\n● Remove the the proxy parameter.\nracadm set lifecyclecontroller.lcattributes.UserProxyUsername\n● View the list of proxy attributes.\nracadm get lifecycleController.lcAttributes"
  },
  "jobqueue ": {
    "description": "Enables you to view and delete a job or jobs in the current Job Queue.\nNOTE:\n● To run this subcommand, you must have the Server control privilege.\n● If an unexpected error message is displayed for any operation, ensure you delete\nsome jobs in the jobqueue and retry the operation.\n● Use jobqueue create command after applying a pending device configuration. Else,\nyou may see a job creation and deletion in the lclog.\n● Multi-object Set commands using XML, or JSON files do NOT require a jobqueue\ncreate command; jobs will be automatically created by the Set command.",
    "syntax": "racadm jobqueue view -i<jobid>\nracadm jobqueue delete [-i<jobid>][--all]\nwhere valid options are -i and --all.\nracadm jobqueue create <fqdd> [-r <reboot type> ] [-s <start\ntime> ] [-e <expiry time>]\nracadm jobqueue create <fqdd> [-r <reboot type>] [-s <start\ntime>] [-e <expiration time>] [--realtime]",
    "input": "-i — Specifies a job ID that is displayed or deleted.\nNOTE: The value JID_CLEARALL will force delete all the possible jobs in the queue.\n● --all — The job IDs that are not applicable are deleted.\n● -fqdd — Specifies an FQDD for which a job should be created.\n● —r <reboot type> — Specifies a reboot type.\n○ none — No Reboot Job. This option is the default value.\n○ pwrcycle — Power cycle.\n○ graceful — Graceful Reboot without forced shut down.\n○ forced — Graceful Reboot with forced shut down.\n● start time — Specifies a start time for job scheduled in the yyyymmddhhmmss\nformat. TIME_NOW means immediate. Next Reboot means job is in scheduled state until\nthe next manual restart.\n● expiry time — Specifies expiry time for the job execution in the yyyymmddhhmmss\nformat. The job must start by this time. TIME_NA means expiry time is not applicable.\n● --realtime — Specifies the real time job.\nNOTE:\n○ --realtime is applicable for storage configuration commands run on\nPowerEdge servers with PERC 9 or newer storage controllers. To check if the\ncontroller supports realtime capability, run storage get controllers -o\n-p RealtimeConfigurationCapability command.\n○ -r option is not valid for real time configuration.\n● Delete all possible jobs from the current job queue.\nracadm jobqueue delete --all\n● Delete a specific job from the current job queue.\nracadm jobqueue delete -i <JobID>\n● To clear all the jobs in the job queue.\nracadm jobqueue delete –i JID_CLEARALL\n● Create a Job for the provided FQDD and add to the job queue.\nracadm jobqueue create NIC.Integrated.1-1 -r pwrcycle -s\nTIME_NOW -e 20120501100000\nNOTE: As RACADM does not support warm boot job creation, you will not observe\nany LCL messages.\n● Create a real time configuration job for the specified RAID controller.\nracadm jobqueue create RAID.Integrated.1-1 -s TIME_NOW --\nrealTime\nRAC1024: Successfully scheduled a job.\nVerify the job status using \"racadm jobqueue view -i\nJID_xxxxx\" command.\nCommit JID = JID_927008261880\n● Create a commit job for InfiniBand objects.\nracadm jobqueue create <InfiniBand FQDD>"
  },
  "krbkeytabupload ": {
    "description": "Uploads a Kerberos keytab file to iDRAC. To run this subcommand, you must have the Server Control\nprivilege.",
    "syntax": "racadm krbkeytabupload [-f <filename>]\n<filename> is the name of the file including the path.",
    "input": "-f — Specifies the filename of the keytab uploaded. If the file is not specified, the keytab file in the\ncurrent directory is selected.",
    "output": "When successful Kerberos Keytab successfully uploaded to the RAC message is displayed.\nIf unsuccessful, appropriate error message is displayed.",
    "example": "racadm krbkeytabupload -f c:\\keytab\\krbkeytab.tab"
  },
  "lclog ": {
    "description": "Allows you to\n● Export the lifecycle log history. The log exports to remote or local share location.\n● View the lifecycle log for a particular device or category\n● Add comment to a record in lifecycle log\n● Add a work note (an entry) in the lifecycle log\n● View the status of a configuration job.\nNOTE:\n● When you run this command on Local RACADM, the data is available to RACADM as a USB partition\nand may display a pop-up message.\n● While Lifecycle Controller is running for racadm commands, you cannot perform other operation\nwhich needs Lifecycle Controller Partition. If the Lifecycle Controller Partition is unreleased\n(because of improper closure of racadm command in the partition), then you must wait 20-35\nminutes to clear the Lifecycle Controller Partition",
    "syntax": "racadm lclog comment edit –q <sequence number> -m <Text to be added>\nracadm lclog view -i <number of records> -a <agent id> -c <category> -s\n<severity> -b <sub-category> -q <sequence no> -n <number of records> -r\n<start timestamp> -e <end timestamp>\nracadm lclog export -f <filename> -u <username> -p <password> -l <CIFS or\nNFS or TFTP or FTP share>\nracadm lclog export -f <filename> -u <username> -p <password> -l <HTTP or\nHTTPS share> -port <port number>\nracadm lclog export -f <filename> -u <username> -p <password> -l <CIFS or\nNFS or TFTP or FTP share> --complete\nracadm lclog export -f <filename> -u <username> -p <password> -l <HTTP or\nHTTPS share> -port <port number> --complete\nracadm -r <idracip> -u <idrac username> -p <idrac password> lclog export\\\n-f <filename> -u <username> -p <password> -l <CIFS or NFS or TFTP or FTP\nshare>\nracadm -r <idracip> -u <idrac username> -p <idrac password> lclog export\\\n-f <filename> -u <username> -p <password> -l <HTTP or HTTPS share>\n-port <port number>\nracadm -r <idracip> -u <idrac username> -p <idrac password> lclog export\\\n-f <filename> -u <username> -p <password> -l <CIFS or NFS or TFTP or FTP\nshare> -- complete\nracadm -r <idracip> -u <idrac username> -p <idrac password> lclog export\\\n-f <filename> -u <username> -p <password> -l <HTTP or HTTPS share> -port\n<port number> -- complete\nracadm lclog viewconfigresult -j <job ID>\nracadm lclog worknote add -m <text to be added>",
    "input": "-i—Displays the number of records present in the active log.\n● -a—The agent ID used to filter the records. Only one agent ID is accepted. The value is case-\ninsensitive. Valid Agent-ID values:\n○ UEFI_SS_USC\n○ CusOsUp\n○ UEFI_Inventory\n○ iDRAC\n○ UEFI_DCS\n○ SEL\n○ RACLOG\n○ DE\n○ WSMAN\n○ RACADM\n○ iDRAC_GUI\n● -k—Filters the records based on the filter string provided in racadm lclog view command.\n● -c — The category used to filter the records. Provides multiple categories using a \",\" as the delimiter.\nThe value is case-insensitive. Valid category values:\n○ System\n○ Storage\n○ Worknotes\n○ Config\n○ Updates\n○ Audit\n● -b —The subcategory used to filter the records. Provides multiple subcategories using a \",\" as the\ndelimiter.\n● -q—The sequence number from which the records must be displayed. Records older than this\nsequence number is displayed.\nNOTE: This parameter input is an integer. If an alphanumeric input is provided, then invalid\nsubcommand syntax error is displayed.\n● -n—Specifies the n number of records that must be displayed. On Local RACADM, if this parameter is\nnot specified, by default 100 logs are retrieved.\n● -r—Displays events that have occurred after this time. The time format is yyyy-mm-dd HH:MM:SS.\nThe time stamp must be provided within double quotation marks.\n● -e—Displays events that have occurred before this time. The time format is yyyy-mm-dd HH:MM:SS.\nThe time stamp must be provided within double quotation marks.\n● -f <filename>—Specifies the file location and name where lifecycle log is exported.\n● -a <name>—Specifies the FTP Server IP address or FQDN, user name, and password.\n● -l <location>—Specifies the location of the network share or area on file system where lifecycle\nlog is exported. Two types of network shares are supported:\n○ SMB-mounted path: //<ipaddress or domain name>/<share_name>/<path to\nimage>\n○ NFS-mounted path: <ipaddress>:/<path to image>.\n● -u <user>—Specifies the user name for accessing the FTP server, or Domain and user name for\naccessing network share location.\n● -p <password>—Specifies the password for accessing the FTP server or share location.\n● -port <port number>—Specifies the port number.\nNOTE: This is an optional parameter. If this option is not specified, the default port number is used.\n● -s—The severity used to filter the records. Provide multiple severities using a \",\" as the delimiter. The\nvalue is case-insensitive. Valid Severity values:\n○ Warning\n○ Critical\n○ Info\n● —m <Comment> —User comment string for a record that must be inserted in the Lifecycle Controller\nlog. This comment string must be less than 128 characters. The text must be specified within double\nquotation mark.\nNOTE: HTML-specific characters may appear as escaped text.\n● -m <Worknote>—Adds a worknote (an entry) in the Lifecycle log. This worknote must be less than\n256 characters. The text must be specified within double quotation mark.\nNOTE: HTML-specific characters may appear as escaped text.\nNOTE: For -m <worknote> and —m <comment> options, you need test alert privilege.\n● --complete—Export the complete Lifecycle log as a compressed file. The exported file is of the\ntype .xml.gz.\n● -j<Job ID>—Specifies the Job ID.\n● Export the complete Lifecycle Log in gzip format to a remote HTTPS share\nracadm lclog export -f log.xml.gz -u httpsuser -p httpspwd -l https://\ntest.com -port 8080\n● Export the Life Cycle Log to a remote HTTP share\nracadm lclog export -f Mylog.xml -u httpuser -p httppwd -l http://\ntest.com -port 8080\n● Export the Life Cycle Log to a remote HTTPS share\nracadm lclog export -f Mylog.xml -u httpsuser -p httpspwd -l https://\ntest.com -port 8080"
  },
  "License ": {
    "description": "Manages the hardware licenses.",
    "syntax": "racadm license view [-c <component>]\n● racadm license import [-f <licensefile>] -l <location> -u <username> -p\n<password> -c <component> [-o]\n● racadm license import -u <username> -p <password> -f <license file\nname>\\ -l <location> -c <FQDD> [-o]\n● racadm license export -f <license file> [-l <location>] [-u <username>]\n[-p <password>] -e <ID> -c <component>\n● racadm license export -u <username> -p <password> -f <license file\nname>\\ -l <location> -t <transaction ID>\n● racadm license export -u <username> -p <password> -f <license file\nname>\\ -l <locaton> -e <entitlement ID>\n● racadm license export -u <username> -p <password> -f <license file\nname>\\ -l <location> -c <FQDD>\n● racadm license delete -t <transaction ID> [-o]\n● racadm license delete -e <entitlement ID> [-o]\n● racadm license delete -c <component> [-o]\nracadm license view [-c <component>]\nracadm license import [-f <licensefile>] -l <location> -u <username> -p\n<password> -c <component> [-o]\nracadm license import -u <username> -p <password> -f <license file\nname>\\ -l <location> -c <FQDD> [-o]\nracadm license export -f <license file> [-l <location>] [-u <username>]\n[-p <password>] -e <ID> -c <component>\nracadm license export -u <username> -p <password> -f <license file\nname>\\ -l <location> -t <transaction ID>\nracadm license export -u <username> -p <password> -f <license file\nname>\\ -l <locaton> -e <entitlement ID>\nracadm license export -u <username> -p <password> -f <license file\nname>\\ -l <location> -c <FQDD>\nracadm license delete -t <transaction ID> [-o]\nracadm license delete -e <entitlement ID> [-o]\nracadm license delete -c <component> [-o]\n● -f — Filename or path to the license file\n● -e <ID> — Specifies the entitlement ID of the license file that must be exported\n● -t <ID> — Specifies the transaction ID.\n● -c <component> — Specifies the component name on which the license is installed.\n● -o — Overrides the End User License Agreement (EULA) warning and imports, replaces or deletes the\nlicense.\n● -u — Username of the system where the file will be exported.\n● -p — Password of the user on the system where the file will be exported.\nNOTE: Only a user with Server Control and Configure iDRAC privilege can run the import,\ndelete, and replace commands.\nNOTE: For export license, you need Login and Configure iDRAC privilege.\nNOTE: This command supports both IPV4 and IPV6 formats. IPV6 is applicable for CIFS and NFS type\nremote shares."
  },
  "netstat ": {
    "description": "Display the routing table and network statistics.",
    "syntax": "racadm netstat\nPrivilege\nRequired\tDebug"
  },
  "networktransceiverstatistics ": {
    "description": "Displays the statistics for the list of NIC transceivers.",
    "syntax": "NOTE: The target server must have iDRAC Datacenter license to run this command.\n● racadm networktransceiverstatistics\n● racadm networktransceiverstatistics <PORT FQDD>\n● racadm networktransceiverstatistics -all",
    "input": "<PORT FQDD>—fully qualified device descriptor of the NIC\n● -all—for all the available network transceivers",
    "example": "To display the available network transceivers managed by the server for statistics\nracadm networktransceiverstatistics\n● To display the statistics of the network transceiver specified by NIC.Integrated.1-1-1:\nracadm networktransceiverstatistics NIC.Integrated.1-1-1\n● To display the statistics of all the network transceivers managed by the server:\nracadm networktransceiverstatistics -all\nracadm networktransceiverstatistics\nracadm networktransceiverstatistics <PORT FQDD>\nracadm networktransceiverstatistics -all"
  },
  "nicstatistics ": {
    "description": "Displays the statistics for the NIC FQDD.",
    "syntax": "racadm nicstatistics\n● racadm nicstatistics <NIC FQDD>\n● racadm hwinventory NIC.Integrated.1-1\nNOTE: Partition Driver State and Partition OS Driver State properties are the same\nfor nicstatistics.\nracadm nicstatistics\nracadm nicstatistics <NIC FQDD>\nracadm hwinventory NIC.Integrated.1-1"
  },
  "pcieslotview ": {
    "description": "The pcieslotview subcommand is used to display PCIe slot details.",
    "syntax": "racadm pcieslotview\n● racadm pcieslotview --all\n● racadm pcieslotview <slot>",
    "input": "<slot> — PCIe slot key.\n● --all — view details of all the PCIe Slots."
  },
  "ping ": {
    "description": "Verifies if the destination IP address is reachable from iDRAC with the current routing-table contents. A\ndestination IP address is required. Based on the current routing-table contents, an ICMP echo packet is\nsent to the destination IP address. To run this subcommand, you must have the Debug privilege.",
    "syntax": "racadm ping <ipaddress>",
    "input": "<ipaddress> — The IP address of the remote endpoint to ping.",
    "output": "PING 192.168.0 (192.168.0): 56 data bytes64 bytes from 192.168.0: seq=0\nttl=64 time=4.121 ms\n192.168.0 ping statistics\n1 packets transmitted, 1 packets received, 0 percent packet lossround-\ntrip min/avg/max = 4.121/4.121/4.121 ms"
  },
  "ping6 ": {
    "description": "Verifies if the destination IPv6 address is reachable from iDRAC or with the current routing-table\ncontents. A destination IPv6 address is required. Based on the current routing-table contents, an ICMP\necho packet is sent to the destination IPv6 address. To run this subcommand, you must have Debug\nprivilege.",
    "syntax": "racadm ping6 <ipv6address>",
    "input": "<ipv6address> — the IPv6 address of the remote endpoint to ping.",
    "example": "Pinging 2011:de11:bdc:194::31 from 2011:de11:bdc:194::101 with 32 bytes\nof data:\nReply from 2011:de11:bdc:194::31: time<1ms\nReply from 2011:de11:bdc:194::31: time<1ms\nReply from 2011:de11:bdc:194::31: time<1ms\nReply from 2011:de11:bdc:194::31: time<1ms\nPing statistics for 2011:de11:bdc:194::31:\nPackets: Sent = 4, Received = 4, Lost = 0 (0% loss),\nApproximate round trip times in milli-seconds:\nMinimum = 0ms, Maximum = 0ms, Average = 0ms"
  },
  "RACADM Plugin ": {
    "description": "The plugin subcommand allows you to perform operations on various plugins.",
    "syntax": "racadm plugin view\n● racadm plugin view --all\n● racadm plugin view <FQDD>\n● racadm plugin enable <FQDD>\n● racadm plugin disable <FQDD>\n● racadm plugin restart <FQDD>\n● racadm plugin uninstall <FQDD>",
    "input": "<FQDD>—Specifies the fully qualified device descriptor of the plugin.\n● --all —Specifies details of all plugins.",
    "example": "To restart the plugin by FQDD\nracadm plugin restart Plugin.Integrated.INT.000\nTo enable the plugin by FQDD\nracadm plugin enable Plugin.Integrated.INT.000\nTo disable the plugin by FQDD\nracadm plugin disable Plugin.Integrated.INT.000\nTo uninstall the plugin by FQDD\nracadm plugin uninstall Plugin.Integrated.INT.000\nTo view the available plugins\nracadm plugin view\nTo view the specific plugin details by FQDD\nracadm plugin view Plugin.Integrated.INT.000\nTo display details of all the plugins\nracadm plugin view --all"
  },
  "RACADM Proxy ": {
    "description": "On the PowerEdge FX2/FX2s systems, you can manage the compute sleds and CMC using\nthe iDRAC’s RACADM Proxy feature that redirects commands from iDRAC to CMC. You\ncan return the CMC response to local or remote RACADM.to access the CMC configuration and reporting\nfeatures without placing the CMC on the management network. The CMC configuration commands are\nsupported through local proxy when local configuration is enabled on iDRAC.\nNOTE: Local racadm and local racadm proxy runs with root user privilege.",
    "syntax": "Local RACADM proxy usage\nracadm <CMC racadm subcommand> --proxy\nRemote RACADM proxy usage\nracadm <CMC racadm subcommand> -u <username> -p <password> -r <idrac-ip\nconnected to cmc> --proxy\nNOTE:\n● The attribute racadm get -g cfgractuning -o cfgRacTuneChassisMgmtAtServer\nmust be set as non-zero in CMC.\n● The attribute racadm get system.ChassisControl.ChassisManagementMonitoring\nattribute must be enabled in iDRAC.\n● --proxy must be entered at the end of the command.\n● The root privilege is the default privilege for Local RACADM proxy.\n● The user privilege in the Remote RACADM proxy for CMC maps to iDRAC privilege.\nTable 88. Details of CMC and iDRAC privilege for an operation\nRequired iDRAC Privilege for proxy\nRequired CMC Privilege for an operation\noperation\nCMC Login User Login\nChassis Configuration Administrator Configure\nUser Configuration Administrator Configure User\nClear Logs Administrator Logs\nChassis Control Administrator System Control\nServer Administrator System Control\nTest Alert User System Operations\nDebug Command Administrator Debug\nFabric x Administrator (where x is A, B, or C) System Control\n● When CMC is not placed on the network, the import, export, and file operation commands to CIFS,\nNFS, or FTP will fail.\n● When the Remote or Local RACADM Proxy operation is in progress, if the iDRAC is reset, then the\nProxy operation fails and the output is not displayed in Remote or Local RACADM.\n● When racadm getsystem.ChassisControl.ChassisManagementMonitoring attribute is\nset to monitor, all the users including root users can only view the attribute. To configure, set the\nattribute to monitor and manage in CMC.",
    "input": "-u — Specifies the user name of the remote share that stores the catalog file.\n● -p — Specifies the password of the remote share that stores the catalog file.\n● -r — Specifies the iDRAC IP address connected to CMC.",
    "example": "Local RACADM\nracadm getractime --proxy\nRemote RACADM\nracadm getractime -u root -p xxx -r 192.168.0 getractime --proxy\nRequired CMC Privilege for an operation\tRequired iDRAC Privilege for proxy\noperation\nCMC Login User\tLogin"
  },
  "Chassis Configuration Administrator Configure ": {},
  "User Configuration Administrator Configure User ": {},
  "Clear Logs Administrator Logs ": {},
  "Chassis Control Administrator System Control ": {},
  "Server Administrator System Control ": {},
  "Test Alert User System Operations ": {},
  "Debug Command Administrator Debug ": {},
  "Fabric x Administrator (where x is A, B, or C) System Control ": {},
  "racdump ": {
    "description": "Provides a single command to get dump, status, and general iDRAC board information. To run this\nsubcommand, you must have the Debug permission.\n● General System/RAC Information\n● Coredump Information\n● Network Interface Statistics\n● Session Information\n● Process Information\n● RAC Firmware Build Log\nNOTE: The RAC debug logs are not part of Local and Remote RACADM. It is available only on\nFirmware RACADM",
    "syntax": "racadm racdump",
    "input": "N/A"
  },
  "racreset ": {
    "description": "Resets iDRAC. The reset event is logged in the iDRAC log. To run this subcommand, you must have the\nConfigure iDRAC permission and configure user privilege.\nNOTE: After you run the racreset subcommand, iDRAC may require up to two minutes to return to a\nusable state.",
    "syntax": "racadm racreset soft\nracadm racreset hard\nracadm racreset soft -f\nracadm recreset hard -f",
    "input": "-f — This option is used to force the reset.",
    "output": "racadm racreset\nRAC reset operation initiated successfully. It may take up to a minute\nfor the RAC to come online again.",
    "example": "iDRAC reset\nracadm racreset"
  },
  "racresetcfg ": {
    "description": "Deletes your current iDRAC configuration and resets iDRAC to the factory default settings based on the\noptions provided. If you run racresetcfg from a network client for example, a supported web browser,\nSSH, or Remote RACADM), use the default IP address which is 192.168.0.120. The racresetcfg\nsubcommand does not reset the cfgDNSRacName object. To run this subcommand, you must have the\nConfigure iDRAC privilege and Configure User privilege.\nNOTE: Certain firmware processes must be stopped and restarted to complete the reset to defaults.\niDRAC becomes unresponsive for about 30 seconds while this operation completes.",
    "syntax": "RAC reset operation initiated successfully. It may take several minutes for the RAC to come online\nagain.\nracadm racresetcfg\n● racadm racresetcfg -f\n● racadm racresetcfg [-all]\n● racadm racresetcfg [-rc]",
    "input": "-f—Force racresetcfg. If any vFlash partition creation or formatting is in progress, iDRAC returns a\nwarning message. You can perform a force reset using this option.\n● -all—Discard all settings and reset user to shipping value.\n● -rc—Discard all settings and reset user to default user name and password.\nNOTE: When you perform racresetcfg -rc on Stomp and Noble/VRTX servers, by default, the\nDHCP is disabled.",
    "example": "Reset the configuration on iDRAC.\nracadm racresetcfg\nThe RAC configuration has initiated restoration to factory defaults. Wait up to a minute for this process\nto complete before accessing the RAC again.\n● Reset when vFlash partition creation is in progress.\nracadm racresetcfg\nA vFlash SD card partition operation is in progress. Resetting the iDRAC may corrupt the vFlash SD\ncard. To force racresetcfg, use the -f flag.\n● Reset all iDRAC's configurations to default, and preserve the user and network settings.\nracadm racresetcfg -f\n● Reset all iDRAC's configurations to default, and reset the user to shipping value.\nracadm racresetcfg -all\n● Reset all iDRAC's configurations to default, and reset the user to root/calvin.\nracadm racresetcfg -rc\nracadm racresetcfg\nracadm racresetcfg -f\nracadm racresetcfg [-all]\nracadm racresetcfg [-rc]"
  },
  "Recover sub-command ": {
    "description": "Allows you to recover the previous version of the firmware.\nNOTE: To run this subcommand, you must have the Server Control privilege.",
    "syntax": "To recover the BIOS firmware\nracadm recover <FQDD>\nNOTE: BIOS.Setup.1-1 is the supported FQDD",
    "input": "FQDD— Specify the FQDD of the device for which the recovery is required.",
    "example": "s\tTo recover the BIOS firmware\nracadm recover BIOS.Setup.1-1\nRAC1234: Recovery operation initiated successfully. Check the Lifecycle logs for the status of the\noperation by running RACADM command \"racadm lclog view\"."
  },
  "remoteimage ": {
    "description": "Connects, disconnects, or deploys either media file or directory on a remote server.\nNOTE: Attach directory feature is only supported on 15th generation and newer PowerEdge servers.\nTo run this subcommand, you must log in with virtual media privilege for iDRAC.",
    "syntax": "racadm remoteimage -d\n● racadm remoteimage -s\n● racadm remoteimage -c [-u <username> -p <password> -l <image_path>]",
    "input": "-c—Connect the image.\n● -d—Disconnect image.\n● -u—User name to access shared folder.\n● -p—Password to access shared folder.\n● -l —Image location on the network share; use single quotation marks around the location.\n● -s —Display current status.\nNOTE: Use a forward slash (/) when providing the image location. If backward slash (\\) is used,\noverride the backward slash for the command to run successfully. For example:\nracadm remoteimage -c -u user -p xxx -l /\\/\\192.168.0.2/\\CommonShare/\n\\diskette\nNOTE: The following options only apply to connect and deploy actions\n● -u —Username. User name to access the network share. For domain users, you can use the following\nformats:\n○ domain/user\n○ domain\\user\nracadm remoteimage -d\nracadm remoteimage -s\nracadm remoteimage -c [-u <username> -p <password> -l <image_path>]\n○ user@domain\n● -p —Password to access the network share.",
    "example": "Disable Remote File Sharing.\n● racadm remoteimage -d Disable Remote File Started. Please check status\nusing -s option to know Remote File Share is ENABLED or DISABLED.\n● Check Remote File Share status.\n● racadm remoteimage -s Remote File Share is Enabled UserName Password\nShareName //192.168.0/xxxx/dtk_3.3_73_Linux.iso\n● Deploy a remote image on iDRAC CIFS Share.\n● racadm remoteimage -c -u admin -p xxx -l //192.168.0.32/dev/OM840.iso\n● Deploy a remote image on iDRAC NFS Share.\n● racadm remoteimage -c -u root -p password -l '192.168.1.113:/opt/nfs/Test\nNOTE: In the above example, Test is a folder name .\n● Deploy a remote image on iDRAC HTTP Share.\n● racadm remoteimage -c -u \"user\" -p \"xxx\" -l http://shrloc/foo.iso\n● Deploy a remote image on iDRAC HTTPS Share.\n● racadm remoteimage -c -u \"user\" -p \"xxx\" -l https://shrloc/foo.iso\nNOTE: -p and -u options are not mandatory in case of HTTP/HTTPS based remoteimage commands."
  },
  "remoteimage2 ": {
    "description": "Connects, disconnects, or deploys either media file or directory on a remote server. To run this\nsubcommand, you must log in with virtual media privilege for iDRAC.\nNOTE: Use this command to attach second remote image simultaneously.\nNOTE: Attach directory feature is only supported on 15th generation and newer PowerEdge servers.",
    "syntax": "racadm remoteimage2 -d\n● racadm remoteimage2 -s\n● racadm remoteimage2 -c [-u <username> -p <password> -l <image_path>]",
    "input": "-c—Connect the image.\n● -d—Disconnect image.\n● -u—User name to access shared folder.\n● -p—Password to access shared folder.\n● -l —Image location on the network share; use single quotation marks around the location.\n● -s —Display current status.\nNOTE: Use a forward slash (/) when providing the image location. If backward slash (\\) is used,\noverride the backward slash for the command to run successfully. For example:\nracadm remoteimage2 -c -u user -p xxx -l /\\/\\192.168.0.2/\\CommonShare/\n\\diskette\nNOTE: The following options only apply to connect and deploy actions\nracadm remoteimage2 -d\nracadm remoteimage2 -s\nracadm remoteimage2 -c [-u <username> -p <password> -l <image_path>]\n● -u —Username. User name to access the network share. For domain users, you can use the following\nformats:\n○ domain/user\n○ domain\\user\n○ user@domain\n● -p —Password to access the network share.",
    "example": "Disable Remote File Sharing.\nracadm remoteimage2 -d\nDisable Remote File Started. Please check status using -s option to\nknow Remote File Share is ENABLED or DISABLED.\n● Check Remote File Share status. racadm remoteimage2 -s Remote File Share is\nEnabled UserName Password ShareName //192.168.0/xxxx/dtk_3.3_73_Linux.iso\n● Deploy a remote image on iDRAC CIFS Share. racadm remoteimage2 -c -u admin -p xxx\n-l //192.168.0.32/dev/Test\nNOTE: In the above example, Test is a folder name.\n● Deploy a remote image on iDRAC NFS Share. racadm remoteimage2 -c -u root -p\npassword -l '192.168.1.113:/opt/nfs/OM840.iso\n● Deploy a remote image on iDRAC HTTP Share.\nracadm remoteimage2 -c -u \"user\" -p \"xxx\" -l http://shrloc/foo.iso\n● Deploy a remote image on iDRAC HTTPS Share. racadm remoteimage2 -c -u \"user\" -p\n\"xxx\" -l https://shrloc/foo.iso\nNOTE: -p and -u options are not mandatory in case of HTTP/HTTPS based remoteimage2\ncommands."
  },
  "rollback ": {
    "description": "Allows you to roll back the firmware to an earlier version.",
    "syntax": "racadm rollback <FQDD> [--reboot]\nNOTE: To get the list of available rollback versions and FQDDs, run the racadm swinventory\ncommand.",
    "input": "<FQDD>: Specify the FQDD of the device for which the rollback is required.\n● --reboot: Performs a graceful system reboot after the BIOS firmware rollback.",
    "example": "To perform BIOS firmware rollback\nracadm rollback iDRAC.Embedded.1-1\nRAC1056: Rollback operation initiated successfully.\n● To perform a graceful system reboot after BIOS firmware rollback:\nracadm rollback BIOS.Setup.1-1 --reboot"
  },
  "sekm ": {
    "description": "The sekm subcommand is used to enable and disable sekm support for a server, rekey sekm-supported\ndevices on a server, and test the SSL connection to a given sekm server. To run this subcommand, you\nmust have the following privileges:\n● Enable—server control and configure iDRAC privileges\n● Disable—server control and configure iDRAC privileges\n● Rekey—server control and configure iDRAC privileges\n● Testserverconnection—server control and configure iDRAC privileges\n● Getstatus—login privileges",
    "syntax": "NOTE: To run enable, disable, and testserverconnection commands, the target server must have sekm\nlicense.\nracadm sekm getstatus\nracadm sekm enable\nNOTE: When you execute racadm sekm enable, a job ID is returned, query this job id to see the\nstatus of sekm. If the query reports failure, check the job ID config results or Lifecycle Controller(LC)\nlogs to find the reason for failure.\nracadm sekm disable\nracadm sekm disable -purgeKMSKeys\nracadm sekm rekey <IDRAC FQDD>\nracadm sekm testserverconnection -p -i <index of the sekm server>\nracadm sekm testserverconnection -s -i <index of the sekm server>\nracadm sekm enable -passphrase <password>",
    "input": "-i—Index of the sekm server to test\n● -p—Indicates primary sekm server\n● -s—Indicates secondary sekm server\n● -purgeKMSKeys—Purge the Key Management Server keys\n● -passphrase—To enter a passphrase when updating encryption mode from iLKM to sekm.\nTo disable sekm feature and purge KMS keys:\nracadm sekm disable -purgeKMSKeys\nTo request iDRAC to rekey all the devices:\nracadm sekm rekey iDRAC.Embedded.1\nTo test primary sekm server connection:\nracadm sekm testserverconnection -p -i 1\nTo test the secondary sekm server connection:\nracadm sekm testserverconnection -s -i 1\nTo change security mode to sekm from ilkm:\nracadm sekm enable -passphrase password\nNOTE: Only one primary server is supported. Option -i should be 1.\nNOTE: For sekm getstatus, the returned values and their meaning are as follows:\n● Disabled—sekm functionality has been disabled on iDRAC and no sekm functions are available.\n● Enabled—sekm functionality has been enabled on iDRAC and all sekm functions are available.\n● Failed—iDRAC is unable to communicate with the sekm server.\n● Unverified Changes Exist—Changes have been made to the sekm configuration but not yet\nenabled using the racadm sekm enable command."
  },
  "serialcapture ": {
    "description": "The serialcapture subcommand is used to is used to export and clear serial data captured from the system.\nTo run this subcommand, you must have the following privileges:",
    "syntax": "NOTE: To run clear and export commands, the target server must have iDRAC Datacenter license.\nTo clear serial data.\nracadm serialcapture clear\nTo export serial data.\nracadm serialcapture export -u <shareuser> -p <sharepassword> -l <NFS/\nCIFS/HTTP/HTTPS share> -f <FileName>",
    "input": "-f—Filename of the exported serial data.\n● -u—Username of the remote share to where the file must be exported. The username must be\nspecified as domain/username.\n● -p—Password for the remote share to where the file must be exported.\n● -l—Network share location to where the serial data captured must be exported. For more information\non NFS or CIFS or HTTP or HTTPS share, see section on Usage examples.",
    "example": "To clear serial data buffer.\nracadm serialcapture clear\nTo export serial data to CIFS share.\nracadm serialcapture export -u cifsuser -p cifspassword -l //1.2.3.4/\ncifsshare -f datafile\nTo export serial data to NFS share.\nracadm serialcapture export -u nfssuser -p nfspassword -l 1.2.3.4:/\nnfsshare -f datafile\nTo export serial data to HTTP share.\nracadm serialcapture export -u httpuser -p httppassword -l http:/1.2.3.4/\nhttpshare -f datafile\nTo export serial data to HTTPS share.\nracadm serialcapture export -u httpsuser -p httpspassword -l https:/\n1.2.3.4/cifsshare -f datafile"
  },
  "sensorsettings ": {
    "description": "Allows you to perform threshold settings of the sensor. To run this subcommand, you must have\nConfigure iDRAC privilege.\nNOTE: An error message is displayed when the following is performed:\n● A set operation is performed on an unsupported FQDD.\n● Out of range settings is entered.\n● Invalid sensor FQDD is entered.\n● Invalid threshold level filter is entered.",
    "syntax": "racadm sensorsettings set <FQDD> -level Min <value>",
    "input": "<FQDD> — Sensor or corresponding sensor FQDD which needs a threshold configuration. Run\nthe command, racadm getsensorinfo to view the sensor FQDD. The R/W field in the output\ngetsensorinfo indicates if the sensor thresholds can be configured. Replace the <FQDD> field with the\ncorresponding sensor FQDD that needs a threshold configuration.\n● -level — threshold level for the sensor setting. Values are Max or Min.",
    "example": "s\tTo set the minimum noncritical threshold level for a power sensor type.\nracadm sensorsettings set iDRAC.Embedded.1#SystemBoardCPUUsage -level Max\n95\nNOTE: The entered value must be lesser or higher than the sensor critical threshold limit."
  },
  "serveraction ": {
    "description": "Enables you to perform power management operations on the blade system. To run this subcommand, you\nmust have the Execute Server Control Commands permission.",
    "syntax": "racadm serveraction <action> -f",
    "input": "<action> — Specifies the power management operation to perform. The options are\n● hardreset — Performs a force reset (reboot) operation on the managed system.\n● powercycle — Performs a power-cycle operation on the managed system. This action is similar to\npressing the power button on the system’s front panel to turn off and then turn on the system.\n● powerdown — Powers down the managed system.\n● powerup — Powers up the managed system.\n● powerstatus — Displays the current power status of the server (ON or OFF).\n● graceshutdown — Performs a graceful shutdown of the server. If the operating system on the\nserver cannot shut down completely, then this operation is not performed.\n● nmi — Generates the Non-masking interrupt (NMI) to halt the system operation. The NMI sends a\nhigh-level interrupt to the operating system, which causes the system to halt the operation to allow\ncritical diagnostic or troubleshooting activities.\nNOTE:\nThe halt system operation does not occur on systems running the Linux operating system.\n● -f — Force the server power management operation. This option is applicable only for the PowerEdge-\nVRTX platform. It is used with powerdown,powercycle, and hardreset options.\nNOTE: The actionpowerstatus is not allowed with -a option.",
    "output": "Displays an error message if the requested operation is not completed, or a success message if the\noperation is completed.",
    "example": "Get Power Status on iDRAC\nracadm serveraction powerstatus\nServer Power Status: ON\nracadm serveraction powercycle\nServer power operation successful"
  },
  "setled ": {
    "description": "Sets the state (blinking or not blinking) of the LED on the specified module. To run this subcommand, you\nmust have the Configure iDRAC permission.",
    "syntax": "racadm setled -l <ledState>",
    "input": "-l <ledState> — Specifies the LED state. The values are\n○ 0 — No Blinking\n○ 1 — Blinking",
    "example": "From iDRAC stop LED from blinking.\nracadm setled -l 0\nRAC0908: System ID LED blink off.\n● From iDRAC start LED to blink.\nracadm setled -l 1\nRAC0907: System ID LED blink on."
  },
  "setniccfg ": {
    "description": "Sets the iDRAC IP address for static and DHCP modes. To run this subcommand, you must have the\nConfigure iDRAC privilege.\nNOTE: The terms NIC and Ethernet management port may be used interchangeably.",
    "syntax": "racadm setniccfg -d\n● racadm setniccfg -d6\n● racadm setniccfg -s <IPv4Address> <netmask> <IPv4 gateway>\n● racadm setniccfg -s6 <IPv6 Address> <IPv6 Prefix Length> <IPv6 Gateway>\n● racadm setniccfg -o",
    "input": "-d — Enables DHCP for the NIC. It is enabled by default.\n● -d6 — Enables AutoConfig for the NIC (default is disabled).\n● -s — Enables static IP settings. The IPv4 address, netmask, and gateway must be specified.\nOtherwise, the existing static settings are used. <ipaddress>, <netmask>, and <gateway> must\nbe typed as dot-separated strings.\nracadm setniccfg -s 192.168.0 255.255.255.0 192.168.0\n● -s6 — Enables static IPv6 settings. The IPv6 address, Prefix Length, and the IPv6 Gateway can be\nspecified.\n● -o — Enable or disable NIC.",
    "example": "To Configure static IPv4 address for iDRAC NIC\nracadm setniccfg -s 192.168.0 255.255.255.0 192.168.0\nStatic IP configuration enabled and modified successfully\n● Configure DHCP mode for iDRAC IPv4\nracadm setniccfg -d\nDHCP is now ENABLED\n● Configure DHCP mode for iDRAC IPv6\nracadm setniccfg -d6\nDHCP6 is now ENABLED\nracadm setniccfg -d\nracadm setniccfg -d6\nracadm setniccfg -s <IPv4Address> <netmask> <IPv4 gateway>\nracadm setniccfg -s6 <IPv6 Address> <IPv6 Prefix Length> <IPv6 Gateway>\nracadm setniccfg -o"
  },
  "spdm ": {
    "description": "The spdm command is used to display inventory of spdm capable devices, list spdm capable FQDDs, and to\ncollect and export the hardware and software identity of spdm devices.\nNOTE: This command is enabled for Emulex cards only.",
    "syntax": "racadm spdm list\nracadm spdm <FQDD>\nracadm spdm export -f <filename> -c <FQDD> -t <identity cert type> -u\n<username> -p <password> -l <CIFS/NFS share>",
    "input": "-f <filename>—File name\n● -c <FQDD>—FQDD of SPDM device\n● -t <identity cert type>—Type of identity\n○ t 0 — Hardware identity\nNOTE: SPDM command only supports hardware identification certificates.\n● -u <username>—Username for the remote share where the file must be exported. Username in a\ndomain can be given as domain/username.\n● -p <password>—Password for the remote share where the file must be exported.\n● -l <CIFS/NFS share>—Network share location where the SPDM identity must be exported.",
    "example": "To list the FQDDs which are spdm capable\nracadm spdm list\nTo display the inventory of spdm capable devices:\nracadm spdm FC.Slot.1-1\nTo export the hardware identity to a remote CIFS share::\nracadm spdm export -f MyCert.cert -c FC.Slot.1-1 -t 0 -u admin -p mypass\n-l //10.94.161.103/share\nTo export the hardware identity to a remote NFS share::\nracadm spdm export -f MyCert.cert -c FC.Slot.1-1 -t 0 -u admin -p mypass\n-l 10.94.161.103:/share"
  },
  "sshpkauth ": {
    "description": "Enables you to upload and manage up to 4 different SSH public keys for each user. You can upload a key\nfile or key text, view keys, or delete keys. This command has three mutually exclusive modes determined\nby the options — upload, view, and delete. To run this subcommand, you must have Configure user\nprivilege.",
    "syntax": "racadm sshpkauth -i svcacct -k <key_index> -t <PK_key_text>\n● racadm sshpkauth -i svcacct -k <key_index> -f <PK_key_text>\n● racadm sshpkauth -v -i svcacct -k all|<key_index>\n● racadm sshpkauth -d -i svcacct -k all|<key_index>",
    "input": "-i <user_index> — Index for the user.\n● -k [<key_index> | all] — Index to assign the PK key being uploaded. all only works with the\n-v or -d options. <key_index> must be between 1 to 4 or all on iDRAC.\n● -t <PK_Key_Text> — Key text for the SSH Public key.\n● -f <filename> — File containing the key text to upload.\nNOTE: The -f option is not supported on SSH or serial RACADM.\n● -v — View the key text for the index provided.\n● -d — Delete the key for the index provided.\nracadm sshpkauth -i svcacct -k <key_index> -f <PK_key_text>\nracadm sshpkauth -v -i svcacct -k all|<key_index>\nracadm sshpkauth -d -i svcacct -k all|<key_index>"
  },
  "sslcertdelete ": {
    "description": "Command to delete a custom signing certificate from iDRAC. To run this subcommand for web server\ncertificates, you must have Login to iDRAC and Configure iDRAC privileges and for others only\nConfigure iDRAC privilege is required.",
    "syntax": "racadm sslcertdelete -t <type>\n● racadm sslcertdelete -t 8 -i <instance(1 or 2)>",
    "input": "-t—Specifies the type of certificate to delete. The type of certificate is\n○ 3—Custom signing certificate\n○ 4—Client trust certificate for SSL\n○ 6—SEKM SSL certificate\n○ 7—KMS CA certificate\n○ 8—Rsyslog Server CA\n○ 12—Rsyslog Server CA cert\n○ 13—Rsyslog Client trust cert\n○ 16—Custom certificate\n● -i—Instance value should be 1 or 2. This is applicable only for Rsyslog Server CA certificate(-t 8).",
    "output": "The following information is displayed\n● The custom signing certificate was deleted.\n● The iDRAC resets and may be offline temporarily.\n● Telemetry certificate deleted successfully.",
    "example": "Use Remote RACADM to delete the custom signing certificate.\n$ racadm -r 192.168.0 -u root -p xxx sslcertdelete -t 3\n● Use Remote RACADM to delete the Client Trust certificate for SSL.\n$ racadm -r 192.168.0 -u root -p xxx sslcertdelete -t 4\n● Use Remote RACADM to delete the telemetry certificate.\nracadm -r 192.168.0 -u root -p xxx sslcertdelete -t 8 -i 1"
  },
  "sslcertdownload ": {
    "description": "Downloads an SSL certificate from iDRAC to the client’s file system. To run this subcommand for web\nserver certificates, you must have Login to iDRAC and Configure iDRAC privileges and for others only\nControl and Configure System privilege is required.\nNOTE: This subcommand is only supported on the remote interface(s).",
    "syntax": "racadm sslcertdownload -f <filename> -t <type>\n● racadm sslcertupload -t 8 -i <instance(1 or 2)>",
    "input": "-f—Specifies the target filename on local file system to download the certificate.\n● -t <type>—Specifies the type of certificate to download, either the CA certificate for Directory\nService or the server certificate.\n○ 1—Server Certificate\n○ 2—Active Directory\n○ 3—Custom Signing Certificate\n○ 4—Client Trust Certificate for SSL\n○ 6—SEKM SSL certificate\n○ 7—KMS CA certificate\n○ 8—Rsyslog Server CA\n○ 9—RSA CA certificate\n○ 10—SCEP CA certificate\n○ 11—SCV Signed Certificate\nNOTE: This input is available for local RACADM only.\n○ 12—Rsyslog Server CA Cert\n○ 13—Rsyslog Client trust Cert\n○ 14—IEEE 802.1X Custom Certificate\n○ 15—IEEE 802.1X Server CA Certificate\n○ 16—Custom certificate\n○ 17—IEEE 802.1X Custom Signing Certificate\n● -i—Instance value should be 1 or 2. This is only applicable for Rsyslog Server CA Certificate(-t 8).",
    "output": "Returns 0 when successful and non-zero number when unsuccessful.\n● racadm sslcertdownload -t 8 -i 1 Telemetry certificate downloaded successfully.",
    "example": "Download server certificate\nracadm -r 192.168.0 -u root -p xxx sslcertdownload -t 1 -f cert.txt\n● Download Active Directory certificate:\nracadm -r 192.168.0 -u root -p xxx sslcertdownload -t 2 -f ad_cert.txt\n● Download telemetry certificate:\nracadm -r 192.168.0 -u root -p xxx sslcertdownload -t 8 -i 1"
  },
  "sslcertupload ": {
    "description": "Uploads a custom SSL server or CA certificate for Directory Service from the client to iDRAC. To run\nthis subcommand, you must have the following privilege:\n● Active Directory certificate - Configure iDRAC and Configure Users.\n● Public Key Cryptography Standards (PKCS) format - Configure iDRAC.\n● Client Trust certificate for SSL format - Configure iDRAC\n● Web server certificate- Login to iDRAC and Configure iDRAC\nNOTE: For this command, files without extension or no extension are allowed.",
    "syntax": "racadm sslcertupload -t <type> -f <filename> -p <passphrase>\n● racadm sslcertupload -t 8 -i <instance(1 or 2)>",
    "input": "-f—Specifies the source filename in the local file system of the certificate uploaded.\n● -p—Pass phrase for the Public Key Cryptography Standards file.\n● -t—Specifies the type of certificate to upload. The type of certificate must be:\n○ 1—Server certificate\n○ 2—CA certificate for Directory Service\n○ 3—Public Key Cryptography Standards (PKCS) format\n○ 4—Client Trust certificate for SSL format\n○ 6—SEKM SSL certificate\n○ 7—KMS CA certificate\n○ 8—Rsyslog Server CA\n○ 9—RSA CA certificate\n○ 10—SCEP CA certificate\n○ 12—Rsyslog Server CA Cert\n○ 13— Rsyslog Client trust Cert\n○ 14— IEEE 802.1X Custom Certificate\n○ 15— IEEE 802.1X Server CA Certificate\n○ 16—Custom certificate\n○ 17— IEEE 802.1X Custom Signing Certificate\n● -i—Instance value should be 1 or 2. This is applicable only for Rsyslog Server CA certificate(-t\n8).",
    "output": "racadm -r 192.168.0.2 -u root -p xxx sslcertupload -t 2 -f cert.txt\nCertificate that is successfully uploaded to the RAC.\n● racadm sslcertupload -t 8 -i 1 Telemetry certificate uploaded successfully.",
    "example": "Uploading a server certificate\nracadm -r 192.168.0.2 -u root -p xxx sslcertupload -t 1 -f cert.txt\n● Uploading web server certificate and key:\nracadm -r 192.168.0.2 -u root -p xxx sslcertupload -t 6 -f cert.txt\n-k key.txt\n● Uploading Active Directory certificate:\nracadm -r 192.168.0.2 -u root -p xxx sslcertupload -t 2 -f\nad_cert.txt\n● Uploading Client Trust certificate for SSL:\nracadm -r 192.168.0.2 -u root -p xxx sslcertupload -t 4 -f\nhttps_cert.cer\n● Uploading a telemetry certificate:\nracadm -r 192.168.0.2 -u root -p xxx sslcertupload -t 8 -i 1"
  },
  "sslcertview ": {
    "description": "Displays the SSL server or CA certificate that exists on iDRAC.",
    "syntax": "racadm sslcertview -t <type> [-A]\n● racadm sslcertview -t <type> -i <instance>",
    "input": "-t—Specifies the type of certificate to view\n○ 1—Server Certificate\n○ 2—Active Directory\n○ 4—Client Trust certificate for SSL\n○ 6—SEKM SSL certificate\n○ 7—KMS CA certificate\n○ 8—Rsyslog CA certificate\n○ 9—RSA CA certificate\n○ 10—SCEP CA certificate\n○ 12—Rsyslog Server CA cert\n○ 13—Rsyslog Client trust cert\n○ 14—IEEE 802.1X Custom Certificate\n○ 15—IEEE 802.1X Server CA Certificate\n○ 17—IEEE 802.1X Custom Signing Certificate\n● -A—Prevents printing headers or labels.\n● -i—Instance value should be 1 or 2. This is applicable only for Rsyslog Server CA certificate (-t 8)\nNOTE: If a certificate is generated using a comma ‘,’ as one of the parameters, command displays the\npartial name in the following fields only until the comma:\n● Organization Name\n● Common Name\n● Location Name\n● State Name\nThe rest of the string is not displayed.",
    "output": "racadm sslcertview -t 1\nSerial Number 01\nSubject Information:\nCountry Code (CC) US\nState (S) Texas\nLocality (L) Round Rock\nOrganization (O) Dell Inc.\nOrganizational Unit (OU) Remote Access Group\nCommon Name (CN) iDRAC Default certificate\nIssuer Information:\nCountry Code (CC) US\nState (S) Texas\nLocality (L) Round Rock\nOrganization (O) Dell Inc.\nOrganizational Unit (OU) Remote Access Group\nCommon Name (CN) iDRAC Default certificate\nValid From May 15 23:54:19 2017 GMT\nValid To May 12 23:54:19 2027 GMT\n● racadm sslcertview -t 1 -A\n00\nUS\nTexas\nRound Rock\nDell Inc.\nRemote Access Group\niDRAC default certificate\nUS\nTexas\nRound Rock\nDell Inc.\nRemote Access Group\niDRAC default certificate\nMay 15 23:54:19 2017 GMT\nMay 12 23:54:19 2027 GMT",
    "example": "To view the server certificate\nracadm -r 192.168.0.2 -u root -p xxx sslcertview -t 1\nracadm -r 192.168.0.2 -u root -p xxx sslcertview -t 8 -i 1\n● To view the server certificate with headers and labels omitted:\nracadm -r 192.168.0.2 -u root -p xxx sslcertview -t 1 -A\nracadm -r 192.168.0.2 -u root -p xxx sslcertview -t 8 -i 1 -A"
  },
  "sslcsrgen ": {
    "description": "Generates and downloads a certificate signing request (CSR) file to the client’s local file system. The CSR\ncan be used for creating a custom SSL certificate that can be used for SSL transactions on iDRAC. To run\nthis subcommand, you must have the Configure iDRAC privilege.",
    "syntax": "racadm sslcsrgen -g\n● racadm sslcsrgen [-g] [-f <filename>]\n● racadm sslcsrgen -s\n● racadm sslcsrgen –g -t <csr_type>\n● racadm sslcsrgen -g -f <filename> -t <csr_type>\n● racadm sslcsrgen -s -t <csr_type>",
    "input": "-g—Generates a new CSR.\n● -s—Returns the status of a CSR generation process (generation in progress, active, or none).\n● -f—Specifies the filename of the location, <filename>, where the CSR is downloaded.\nNOTE: The -f option is only supported on the remote interfaces.\n● -t —Specifies the type of CSR to be generated. The options are:\n○ 1—SSL cert\n○ 2—Factory Identity Cert\n○ 3—SEKM SSL Cert\n○ 4—Rsyslog SSL Cert",
    "output": "If no options are specified, a CSR is generated and downloaded to the local file system as sslcsr by\ndefault. The -g option cannot be used with the -s option, and the -f option can only be used with the -g\noption. The sslcsrgen -s subcommand returns one of the following status codes:\n● CSR was generated successfully.\n● CSR does not exist.\nracadm sslcsrgen -g\nracadm sslcsrgen [-g] [-f <filename>]\nracadm sslcsrgen -s\nracadm sslcsrgen –g -t <csr_type>\nracadm sslcsrgen -g -f <filename> -t <csr_type>\nracadm sslcsrgen -s -t <csr_type>\n● Display the status of the current CSR operation for Rsyslog SSL Cert\nracadm sslcsrgen -s -t 4"
  },
  "sslkeyupload ": {
    "description": "Uploads SSL key from the client to iDRAC. To run this subcommand, you must have the Login and\nConfigure iDRAC privileges.",
    "syntax": "racadm sslkeyupload -t <type> -f <filename>",
    "input": "-t — Specifies the key to upload. The value is\n○ 1 — SSL key used to generate the server certificate.\n● -f — Specifies the filename of the SSL key that must be uploaded.",
    "output": "If upload is successful, the message SSL key successfully uploaded to the RAC is displayed. if\nupload is unsuccessful, error message is displayed.",
    "example": "racadm sslkeyupload -t 1 -f c:\\sslkey.txt"
  },
  "sslresetcfg ": {
    "description": "Restores the web-server certificate to factory default and restarts web-server. The certificate takes effect\n30 seconds after the command is entered. To run this subcommand, you must have the Configure iDRAC\nprivilege.",
    "syntax": "racadm sslresetcfg",
    "input": "N/A",
    "example": "racadm sslresetcfg\nWeb server is restarting to complete the certificate update. Please wait\nfor a few minutes for this process to complete."
  },
  "storage ": {
    "description": "Allows you to run the commands to control storage arrays. To run this subcommand for configuring the\nstorage properties, you must have the server control permission.",
    "syntax": "Inventory\nNOTE: You can also run the command using raid in place of the storage command.\n● To view the help details for get command, run the following command:\nracadm storage help get\n● To generate and view information about the inventory of storage root node, run the following\ncommand:\nracadm storage get status\n● To generate and view information about the inventory of controllers, run the following command:\nracadm storage get controllers -o\nracadm storage get controllers -o -p <property names separated by comma>\n● To get the list of controllers, run the following command:\nracadm storage get controllers\n● To get the properties of a controller, run the following command:\nracadm storage get controllers:<Controller FQDD>\nNOTE: HBA, BOSS and PERC controllers connected through slimline cable will have FQDDs starting\nwith SL. Example - NonRaid.SL.5-1, AHCI.SL.5-1, RAID.SL.5-1 and so on.\n● To generate and view information about the inventory of batteries, run the following command:\nracadm storage get batteries -o\nracadm storage get batteries --refkey <Controller FQDDs separated by\ncomma>\nracadm storage get batteries --refkey <Controller FQDDs separated by\ncomma> -o\nracadm storage get batteries --refkey <Controller FQDDs separated by\ncomma> -o -p <property names separated by comma>\n● To generate and view information about the inventory of virtual disks, run the following command:\nracadm storage get vdisks\nracadm storage get vdisks --refkey <Controller FQDDs separated by\ncomma>\nracadm storage get vdisks --refkey <Controller FQDDs separated by\ncomma> -o\nracadm storage get vdisks --refkey <Controller FQDDs separated by\ncomma> -o -p <property names separated by comma>\n● To generate and view information about the inventory of enclosures, run the following command:\nNOTE: FQDD of certain Backplanes may not be the same in Software Inventory and Hardware\nInventory.\nracadm storage get enclosures -o\nracadm storage get enclosures --refkey <Connector FQDDs separated by\ncomma>\nracadm storage get enclosures --refkey <Connector FQDDs separated by\ncomma> -o -p <property names separated by comma>\n● To get the list of enclosures, run the following command:\nracadm storage get enclosures\n● To get the properties of an enclosure, run the following command:\nracadm storage get enclosures:<Enclosure FQDD>\n● To generate and view information about the inventory of physical disk drives, run the following\ncommand:\nracadm storage get pdisks\nracadm storage get pdisks -o\nracadm storage get pdisks -o -p <property names separated by comma>\nracadm storage get pdisks --refkey <Enclosure/Backplanes FQDDs\nseparated by comma>\nracadm storage get pdisks --refkey <Enclosure/Backplanes FQDDs\nseparated by comma> -o\nracadm storage get pdisks --refkey <Enclosure/Backplanes FQDDs\nseparated by comma> -o -p <property names separated by comma>\n● To get the list of physical disks, run the following command:\nracadm storage get pdisks\n● To get the properties of a physical disk, run the following command:\nracadm storage get pdisks:<PD FQDD>\n● To get a list of physical disks in a virtual disk, run the following command:\nracadm storage get pdisks -vdkey:<VD FQDD>\n● To generate and view information about the inventory of fans, run the following command:\nracadm storage get fans --refkey <Enclosure FQDDs separated by comma>\nracadm storage get fans --refkey <Enclosure FQDDs separated by comma >\n-o\nracadm storage get fans --refkey <Enclosure FQDDs separated by comma>\n-o -p <property names separated by comma>\n● To generate and view information about the inventory of EMMs, run the following command:\nracadm storage get emms -refkey <Enclosure FQDDs separated by comma>\nracadm storage get emms --refkey <Enclosure FQDDs separated by comma> -o\nracadm storage get emms --refkey <Enclosure FQDDs separated by comma>\n-o -p <property names separated by comma>\n● To generate and view information about the inventory of PSU, run the following command:\nracadm storage get psus -refkey <Enclosure FQDDs separated by comma>\nracadm storage get psus --refkey <Enclosure FQDDs separated by comma> -o\nracadm storage get psus --refkey <Enclosure FQDDs separated by comma>\n-o -p <property names separated by comma>\nConfiguration\nNOTE: For any storage operation executed, creating a configuration job is needed for the operation\nto be applied. Only storage operations that don't need a configuration job to apply the changes are\nblink/unblink. Also supported is the ability to stack multiple storage operations for one configuration\njob. Examples are execute reset config, create VD, assign hotspare and create\nconfiguration job. For more details on creating configuration job, refer to jobqueue help\ncreate command. Below are the supported input options for storage operations:\n● --refkey—Specifies the controller or enclosure FQDDs.\n● -name—Specifies the new name for the virtual disk.\nNOTE: You can use alphanumeric characters, spaces, dashes, and underscores in the disk name.\nAny other special character that you enter is removed and replaced by a space while creating a\nvirtual disk.\n● -size—Specifies the new size for the virtual disk. It should be more than the current size.\n○ b—Specifies the size in bytes\n○ k—Specifies the size in kilobytes\n○ m—Specifies the size in megabytes\n○ g—Specifies the size in gigabytes\n○ t—Specifies the size in terabytes\n● -rl—Sets the storage level.\n○ r0—storage 0-Striping\n○ r1—storage 1-Mirroring\n○ r5—storage 5-Striping with Parity\n○ r6—storage 6-Striping with Extra Parity\n○ r10—storage 10-Spanned Striping with Mirroring\n○ r50—storage 50-Spanned Striping with Parity\n○ r60—storage 60-Spanned Striping with Extra Parity\n● -new_rl—Specifies the new possible raid level for the virtual disk\n○ r0—RAID0\n○ r1—RAID1\n○ r5—RAID5\n○ r6—RAID6\nNOTE: This is a mandatory option must provide with RLM operation. Possible raid migrations with\ndisk addition are R0-R1, R0-R5/R6,R1-R0/R5/R6, R5-R0/R6, R6-R0/R5. Possible raid migrations\nwithout disk addition are R1-R0, R5-R0, R6-R0/R5.\n● -wp{wt|wb|wbf}—Sets the write policy to Write Through, Write Back, or Write Back Force\n● -rp {nra|ra|ara}—Sets the read policy to No Read Ahead, Read Ahead, Adaptive Read Ahead\n● -ss—Specifies the stripe size to use.\n● -pdkey:<PD FQDD list>—Specifies the physical disk drive to use in the virtual disk.\n● -dcp—Sets the Disk Cache Policy in the Virtual Disk.\n○ enabled—Allows the virtual disk to use the cache.\n○ disabled—Does not allow the virtual disk to use the cache.\n○ default—Uses the default cache policy. For SAS drives, use the disabled option and for SATA\ndrives, use the enabled option by default.\n● -name <VD name>—Specifies the name of the virtual disk.\n● -size <VD size>—Specifies the size of each virtual disk.\n○ b—Specifies the size in bytes\n○ k—Specifies the size in kilobytes\n○ m—Specifies the size in megabytes\n○ g—Specifies the size in gigabytes\n○ t—Specifies the size in terabytes\n● -sc—Number of spans in a virtual disk (required for multi-span RAID level)\nNOTE:\n○ From PERC9 storage controller onwards, if the value of\ncontroller.SupportRAID10UnevenSpans is supported, you can enter only 0 for this\noption while creating RAID level 10. The created RAID10 virtual disk displays the spandepth as 1\n(default).\n○ For other controllers:\n￭ The default value for multi-span RAID levels is 2 and for basic RAID level is 1.\n￭ For hybrid RAID levels such as RAID10, RAID50, and RAID60, this option is mandatory.\n￭ The value for-sc option can be 0 only for RAID10.\n● -T10PIEnable—Creates a virtual disk with protection information.\n● -sd <SecureDisk>—Set the secure disk to encrypt the VD.\n○ enabled—Enable the encryption in VD.\n○ disabled—Disable the encryption in VD.\n● -key <Key id>—Specifies the key id.\n● -passwd <passphrase>—Specifies the passphrase.\n● -newpasswd <passphrase>—Specifies the new passphrase.\n● -assign {yes | no}—Assigns or unassigns the disk as a hotspare.\n● -type { ghs | dhs}—Assigns a global or dedicated hotspare.\n● -vdkey:<VD FQDD>—Assigns the dedicated hotspare to the specified virtual disk. This option is\nrequired for dedicated hotspare.\n● -state <start|stop>—start value starts a patrol read operation. stop value stops a running\npatrol read operation.\nNOTE:\n○ To start the operation, the Controller.PatrolReadMode must be in Manual mode.\n○ The values displayed for properties such as Patrol Read, Check Consistency Rate,\nRebuild Rate, BGI Rate, and Reconstruction Rate are displayed in percentage.\n● -speed—Specifies the initialization of the Virtual disk.\n○ fast—Performs fast initialization.\n○ full—Performs slow initialization.\n● blink: <FQDD> or unblink: <FQDD>—<FQDD> can be physical disk drives, virtual disks, or\nPCIeSSD.\n● <PCIeSSD FQDD>—Specifies the PCIeSSD FQDD.\n● <PCIeSSD controller|enclosure FQDD>—Specifies the PCIeSSD controller or enclosure\nFQDD.\n● preparetoremove—Specifies the PCIeSSD drive to prepare for removal.\nNOTE: Ensure that ISM is installed and running to perform the preparetoremove operation.\n● cryptographicerase—Specifies the PCIeSSD, SED (Self encrypting drive) or ISE device to\nperform the cryptographic erase operation.\nNOTE: If running this operation on an ISE or SED device, it must not be a part of a RAID volume. If\nthe device is part of a RAID volume, delete the volume first and then run cryptographicerase.\n● -mdtype { windows | linux}—Specifies the metadata type for the physical disk conversion to\nRAID\nNOTE: SWRAID only supports mdtype.\n● -mode—Specifies the PERC key management type.\n● -f : <filename>—The filename to export the identity.\n● -u : <username> —Username of the remote share to where the file must be exported.\n● -p : <password>—Password for the remote share to where the file must be exported.\n● -l : <CIFS or NFS share>—Network share location to where the file must be exported.\n● <FQDD>—FQDD of the controller.\n● -t : <identity>—Identity type to be exported.\n0 = Hardware identity\n● To view the help details for a configuration command, run the following command:\nracadm storage help <command>\nwhere command can take below values\nconverttoraid, converttononraid, controllers, clearconfig,\ncreatesecuritykey, createvd, deletesecuritykey,\ndeletevd, encryptvd, enclosures, emms,exportcertificate,\nfans, hotspare, importconfig, ccheck, cryptographicerase,\npreparetoremove, blink, unblink, cancelcheck, renamevd, cancelbgi,\nrebuild, cancelrebuild, capacityexpanon, raidlevelmigrationinit,\nmodifysecuritykey, psus, pdisks, resetconfig, tempprobes, vdisks,\npatrolread, forceonline,\nforceoffline,replacephysicaldisk,unlock,and setbootvd.\nNOTE: iSM must be running on the operating system to run the preparetoremove method:\n● To create, delete, and secure the virtual disks, to start or stop the consistency check on the specified\nvirtual disk, run the following command:\nracadm storage createvd:<Controller FQDD> -rl {r0|r1|r5|r6|r10|r50|r60}\n[-wp {wt|wb|wbf}] [-rp {nra|ra|ara}] [-ss {1k|2k|4k|8k|16k|32k|64k|\n128k|256k|512k|1M|2M|4M|8M|16M}]-pdkey:<comma separated PD FQDD> [-dcp\n{enabled|disabled|default}] [-name <VD name>] [-size <VD size>{b|k|m|g|\nt}] [-T10PIEnable] [-sd <secureDisk>]\nNOTE:\n○ T10PI is no longer supported on PERC controllers.\n○ If the <VD name> exceeds 15 characters when running the createvd command, it gets\ncorrected to a length of 15 characters once the command is completed successfully.\nracadm storage init:<VD FQDD> -speed {fast|full}\nracadm storage deletevd:<VD FQDD>\nracadm storage encryptvd:<VD FQDD>\nracadm storage createsecuritykey:<Controller FQDD> -key <Key id> -xxx\n<passphrase>\nracadm storage modifysecuritykey:<Controller FQDD> -key <Key id>-xxx\n<old passphrase> -xxx <new passphrase>\nracadm storage deletesecuritykey:<Controller FQDD>\nracadm storage ccheck:<VD FQDD>\nracadm storage cancelcheck:<VD FQDD>\n● To set virtual disk as bootvd and replace physical disk in virtual disk:\nracadm storage setbootvd:<Controller FQDD> -vd <VD FQDD >\nracadm storage replacephysicaldisk:<Source PD FQDD > -dstpd\n<Destination PD FQDD>\n● To rename, expansion and raid level migration of the virtual disks and, to rebuild, cancel rebuild and\ncancel the back-ground initialization, run the following command:\nracadm storage renamevd:<VD FQDD > -name <new_vd_name>\nracadm storage capacityexpansion:<VD FQDD > -size <new size VD> -pdkey\n<PD FQDDs>\nracadm storage capacityexpansion:<VD FQDD> -size <new size>.\nracadm storage discardcache:<Controller FQDD>\nracadm storage raidlevelmigration:<VD FQDD > -new_rl <raid_level>\n-pdkey:<PD FQDD separated by commas>\nracadm storage rebuild:<PD FQDD>\nracadm storage cancelrebuild:<PD FQDD>\nracadm storage cancelbgi:<VD FQDD>\n● To convert the physical disk drives and assign or delete a hotspare. To scan physical disks that are\nconnected to a controller and detect problem, run the following command:\nracadm storage converttononraid:<PD FQDD>\nracadm storage converttoraid:<PD FQDD>\n-mdtype <metadataType>\nNOTE: Convert to RAID or Non RAID is not supported on PERC 10 (RAID mode) and BOSS\ncontroller cards. PERC10 in eHBA mode supports convert to RAID or Non-RAID.\nNOTE: -mdtype is only supported for SWRAID controllers.\nracadm storage hotspare:<PD FQDD> -assign yes -type dhs -vdkey: <VD\nFQDD>\nracadm storage hotspare:<PD FQDD> -assign yes –type ghs\nracadm storage hotspare:<PD FQDD> -assign no\nracadm storage patrolread:<Controller FQDD> -state start|stop\nNOTE: If the –assign option is no, you cannot add other options. If the –assign option is yes\nand if the -type option is not present, the global hotspare (ghs) is created by default.\n● To reset, clear, and import the storage configuration to the controller, run the following command:\nracadm storage importconfig:<Controller FQDD>\nracadm storage resetconfig:<Controller FQDD>\nracadm storage clearconfig:<Controller FQDD>\n● To unlock foreign configuration:\nracadm storage unlock:<Controller FQDD> -key <Key id> -passwd\n<passphrase>\n● To start or stop a blink or identify operation on the specified storage device, run the following\ncommand:\nracadm storage blink:<FQDD>\nracadm storage blink:<PCIeSSD FQDD>\nracadm storage unblink:<FQDD>\nracadm storage unblink:<PCIeSSD FQDD>\nNOTE:\n○ The start or stop a blink feature is not supported for HHHL PCIe SSD devices.\n○ BOSS-S2 controllers support blink and unblink feature on M.2 drives.\n● To force a physical disk online, offline\nracadm storage forceonline:<PD FQDD>\nracadm storage forceoffline:<PD FQDD>\nNOTE: Forcing a physical drive offline or online may result in loss of data. For more information, see\nthe latest PERC User's Guide.\n● To prepare the PCIeSSD drive for removal:\nracadm storage preparetoremove <PCIeSSD FQDD>\nNOTE: The Prepare to Remove task is not supported for HHHL PCIe SSD devices.\n● To perform a cryptographic erase operation on PCIeSSD device, run the following command:\nracadm storage cryptographicerase:<PCIeSSD FQDD>\n● To perform a cryptographic erase operation on PCIeSSD device using PSID, run the following command:\nracadm storage cryptographicerase:<SED FQDD> -psid <PSID>\n● To set the encryption mode to Secure Enterprise Key Manager (SEKM) for the PERC controller or\nmigrate from Local Key Manager (LKM) to SEKM mode:\nracadm storage setencryptionmode:<Controller FQDD> -mode <KEY\nManagement Mode> -passphrase <Dell@123>\nNOTE: Ensure that you enable SEKM on iDRAC before enabling SEKM on the PERC controller or\nwhile migrating the PERC controller from LKM to SEKM security mode.\n● To request iDRAC to rekey all devices:\nracadm storage rekey:<Controller FQDD>\n● To export the storage controller identity certificate to a CIFS or NFS share, run the following command:\nNOTE: This command supports both IPV4 and IPV6 formats. IPV6 is applicable for CIFS and NFS\ntype remote shares.\nNOTE: This feature is only supported on storage controllers which support SPDM (Example: PERC\n12).\nracadm storage exportcertificate:<FQDD> -l <CIFS or NFS share> -u\n<username> -p <password> -f <filename> -t <identity>",
    "input": "-o—Specifies the optimized version.\n● -p—Specifies the property name.\nProperty Name\tDescription\tPossible values\nStatus\tThis property specifies the current\nstatus of the controller\t● Unknown\n● Ok\n● Warning\n● Failed\nDeviceDescription\tThis property specifies the type and\nlocation of controller\tAn alphanumeric string\nRollupStatus\tRollup status indicates combined\nstatus of controller and its attached\ncomponents\t● Unknown\n● Ok\n● Warning\n● Failed\nName\tThis property specifies the name of the\ncontroller\tA string value that comes directly from\nthe device\nPciSlot\tThis property specifies if the controller is\ninserted in any PCI slot\tAn integer value\nFirmwareVersion\tThis property specifies the current\nfirmware version of the controller\tAn alphanumeric value. Other characters\nsuch as \".\" and \"-\" are also allowed\nRebuildRate\tThe Rebuild Rate is the percentage of\nthe system's resources dedicated to\nrebuilding a failed disk when a rebuild is\nnecessary\t● \"Not supported\"\n● An integer value\nBgiRate\tThe Background Initialization (BGI) rate\nis the percentage of the system's\nresources dedicated to performing the\nbackground initialization of a virtual disk\nafter it is created\t● \"Not supported\"\n● An integer value\nCheckConsistencyRate\tThe Check Consistency rate is the\npercentage of the system's resources\ndedicated to performing a check\nconsistency on a redundant virtual disk\t● \"Not supported\"\n● An integer value\nReconstructRate\tThe Reconstruct Rate is the percentage\nof the system's resources dedicated to\nreconstructing a disk group after adding\na physical disk or changing the RAID\nlevel of a virtual disk residing on the disk\ngroup\t● \"Not supported\"\n● An integer value\nPatrolReadRate\tThe Patrol Read Rate is the percentage\nof the system's resources dedicated to\nperform Patrol Read\t● \"Not supported \"\n● An integer value\nPatrolReadMode\tPatrol Read is a feature for identifying\ndisk errors in order to avoid disk failures,\ndata loss or corruption. The Patrol Read\nonly runs on disks that are being used in\na virtual disk or that are hot spares\t● Not Supported\n● Disabled\n● Automatic\n● Manual\n● Unknown\nPatrolReadState\tPatrol Read State specifies the current\nPatrol Read operation state\t● Stopped\n● Running\n● Unknown\nProperty Name\tDescription\tPossible values\nCheckConsistencyMode\tCheck Consistency feature is used to\nverify the accuracy of the redundant\n(parity) information\t● Not Supported\n● Normal\n● Stop On Error\n● Unknown\nLoadBalanceSetting\tThis property represents the ability to\nautomatically use both controller ports\nconnected to the same enclosure to\nroute I/O requests\t● Not Supported\n● Auto\n● Disabled\n● Unknown\nCopybackMode\tThis property represents the mode of\nrestoring configuration of a virtual disk\nwhen a failed physical disk is replaced in\nan array\t● Not supported\n● On\n● ON with SMART\n● OFF\n● Unknown\nPreservedCache\tThis property indicates if the controller\nhas preserved cache in it or not\t● Not Present\n● Present\n● Unknown\nCacheMemorySize\tThis property specifies the size of\nthe preserved cache present in the\ncontroller\t● \"Not supported \"\n● Integer value in MB\nPersistHotSpare\tThis property enables or disables the\npersistent hotspare of the controller\t● Disabled\n● Enabled\n● Not Applicable\nKeyID\tThis property specifies the security\nKeyId assigned when security on the\ncontroller is enabled\t● \"Null\"\n● Some string value\nSpindownUnconfiguredDrives\tThis property spins down the\nunconfigured disks if they are\nunattended for a specified interval of\ntime\t● Disabled\n● Enabled\n● Not Applicable\nSpindownHotspare\tThis property spins down the hot spares\nif no read‑write operation takes place on\nthe hot spare in a specified interval of\ntime.\t● Disabled\n● Enabled\n● Not Applicable\nTimeintervalforspindown\tThis property sets the time interval after\nwhich the hot spares and unconfigured\ndrives spins down\tAn integer value in minutes\nSecurityStatus\tThis property specifies the controller\nsecurity capability and current controller\nsecurity status\t● Not Capable\n● Encryption Capable\n● Security Key Assigned\n● Disabled\n● Enabled\nEncryptionMode\tThis property represents the encryption\nmode on the controller. It could be\nused to set the encryption mode to\nLocal Key Management or Dell Key\nManagement on the controller through\nServer Configuration Profile (SCP)\nfeature. It is configurable through Server"
  },
  "Configuration Profile (SCP) feature only. ● ": {},
  "security capability ● ": {},
  "only for SW RAID controller ● ": {},
  "security is enabled ● ": {},
  "supportassist ": {
    "description": "Allows you to perform supportassist operations such as\n● collect : Collects the supportassist data and exports to local share, or remote share, or Dell site\ndepending on the parameters given in the command. You can specify the type of the logs to be in the\ncollect command. To run this command, user must accept the End User License Agreement (EULA).\nNOTE: When performing the collect operation on chassis system, ensure that you use the -t\nDebug option.\n● register : Allows registration of supportassist to enable related features.\n● exportlastcollection : Exports the last collected supportassist data to the share which is\nmentioned in the command or to the default share. Default share can be configured using the\nsupportassist attributes.\n● accepteula : Accepts the End User License Agreement (EULA).\n● geteulastatus: Provides the status of the End User License Agreement (EULA).\n● uploadlastcollection : Upload last collection to Dell supportassist server.\n● exposeisminstallertohostos: Exposes iSM installer to host OS, so that user can install the iSM\nfrom host side.\n● autocollectscheduler: Provides options to create view, and clear the time-based automatic\ncollections. User must perform registration for this feature.\nNOTE: All the commands except accepteula,geteulastatus , and\nautocollectscheduler will create job ID to track the progress of the operation.\nNOTE: SupportAssist register, collect --upload, uploadlastcollection and\nautocollectscheduler view/create/clear commands are not supported in iDRAC\n7.00.00.00 and later versions. Running these commands will generate an EEMI message with the EEMI\nID SRV156.",
    "syntax": "To perform supportassist operation by specifying the type of the operation.\nracadm supportassist <support assist command type>\n● To collect the data and store it in the iDRAC.\nracadm supportassist collect –t <logtype>\n● To collect the data and export to network share\nracadm supportassist collect –t <logtype> -l <CIFS/NFS/TFTP/FTP share>\n-u <username> -p <password>\n● To collect the data and export to HTTP/HTTPS share\nracadm supportassist collect –t <logtype> -l <HTTP/HTTPS share> -u\n<username> -p <password> -port <port number>\n● To collect the data and upload to Dell supportassist server.\nracadm supportassist collect –t <logtype> -upload\n● To collect the data and export to local share. This is only allowed from remote and local RACADM.\nracadm supportassist collect –t <logtype> -f <filename>\n● To collect the data and export to remote share and to Dell supportassist server.\nracadm supportassist collect –t <logtype> -l <CIFS or NFS share\nlocation> -u <username> -p <password> --upload\n● To collect telemetry reports.\nracadm supportassist collect -t TelemetryReports\n● To Export the last collected supportassist data to a remote share.\nracadm supportassist exportlastcollection -l <CIFS/NFS/TFTP/FTP share>\n-u myuser -p mypass\n● To Export the last collected supportassist data to HTTP/HTTPS share.\nracadm supportassist exportlastcollection -l <HTTP/HTTPS share> -u\nmyuser -p mypass -port <port number>\n● To export the last collected supportassist data to the default network share.\nracadm supportassist exportlastcollection\n● To accept End User License Agreement (EULA)\nracadm supportassist accepteula\n● To check End User License Agreement (EULA) status\nracadm supportassist geteulastatus\n● To register iDRAC for supportassist features\nracadm supportassist register -pfname <primary first name> -plname\n<primary last name> -pmnumber <primary number>\n-panumber <primary alternate number> -pmailid <primary email id>\n-sfname <secondary first name> -slname <secondary last name> -smnumber\n<secondary number> -sanumber <secondary alternate number>-smailid\n<secondary email id> -company <company name> -street1 <street1 name>\n-street2 <street2 name> -city <city name> -state <state name> -country\n<country name> -zip <zip or postal code>\n● To upload last collection to Dell supportassist server.\nracadm supportassist uploadlastcollection\n● To expose iSM installer to host operating system.\nracadm supportassist exposeisminstallertohostos\n● To schedule auto collection of supportassist data weekly.\nracadm supportassist autocollectscheduler create -time <time> -dow\n<DayofWeek> -rp <repeat>\n● To schedule auto collection of supportassist data monthly.\nracadm supportassist autocollectscheduler create -time <time> -dom\n<DayOfMonth> -rp <repeat>\nracadm supportassist autocollectscheduler create -time <time> -wom\n<WeekOfMonth> -dow <DayofWeek> -rp <repeat>\n● To schedule auto collection of supportassist data quarterly.\nracadm supportassist autocollectscheduler create -time <time> -wom\n<WeekOfMonth> -dow <DayofWeek> -rp <repeat>\n● To view the auto collection data\nracadm supportassist autocollectscheduler view\n● To clear the auto collection data\nracadm supportassist autocollectscheduler clear\n● -pfname—Specifies the primary user's first name for the registration.\n● -plname—Specifies the primary user's last name for the registration.\n● -pmnumber—Specifies the primary user' s number.\n● -panumber—Specifies the primary user' s alternative number.\n● -pmailid—Specifies the primary user' s email address.\n● -sfname—Specifies the secondary user' s first name.\n● -slname—Specifies the secondary user' s last name.\n● -smnumber—Specifies the secondary user' s number.\n● -sanumber—Specifies the secondary user' s alternate number.\n● -smailid—Specifies the secondary user' s email address.\n● -company—Specifies the company name.\n● -street1—Specifies the street address of the company.\n● -street2—Specifies the secondary street address of the company.\n● -city—Specifies the name of the city.\n● -state—Specifies the name of the state.\n● -country—Specifies the name of the country.\n● -zip—Specifies the zip or postal code.\n● -time—Specifies the time to schedule a supportassist collection in HH:MM 12-hour format.\n● -dom—Specifies the day of the month to schedule a supportassist collection. Valid values are 1-28,\nL(Last day) or '*' (default - any day). If -dom option is included in the command, then -wom and -dow\noptions should not be included.\n● -wom—Specifies the week of the month to schedule a supportassist collection. Valid values are 1-4,\nL(Last week) or '*' (default - any week). If -wom option is included in the command, then only -dow\noption should be included. -dom should not be included.\n● -dow — Specifies the day of the week to schedule a supportassist collection. Valid values sunday,\nmonday,...saturday '*' (default - any day).\n● -rp — Specifies the repeat parameter weekly, or monthly, or quarterly. Weekly is allowed only with\ndow parameter. Monthly/quarterly is allowed either with dom or dow and wom together."
  },
  "swinventory ": {
    "description": "Displays the list of software objects and associated properties that are installed on a server.\nNOTE: Lifecycle Controller and CSIOR should not be enabled to run this subcommand.",
    "syntax": "racadm swinventory",
    "input": "racadm swinventory\nElementName = Witness BIOS Embedded\nFQDD = BIOS.Setup.1-1:System.Integrated.1-1:System.Chassis.1-1\nInstallationDate = 1970-01-01T00:00:00Z\nCurrent Version = 0.0.0\nHashValue = NA\nSidebandUpdate = No\nPLDMCapabilitiesDuringUpdate = 0x0\nPLDMFDPCapabilitiesDuringUpdate = 0x0\n-------------------------------------------------------------------"
  },
  "switchconnection ": {
    "description": "Provides the switch port details of iDRAC and server network ports. Refresh switch port details of all ports\nin the server. To run this command, you must have the Login privilege.",
    "syntax": "racadm switchconnection view\n● racadm switchconnection view [iDRAC FQDD | NIC FQDD]\n● racadm switchconnection refresh",
    "input": "<iDRAC FQDD | NIC FQDD> — is the fully qualified device descriptor of iDRAC or NIC.",
    "example": "s\t● To provide switch port details of all iDRAC and server network port\nracadm switchconnection view\n● To provide switch port details of requested FQDD NIC.Integrated.1-1-1:BRCM\nracadm switchconnection view NIC.Integrated.1-1-1:BRCM\n● To refresh switch port details of all ports in the server\nracadm switchconnection refresh\nracadm switchconnection view\nracadm switchconnection view [iDRAC FQDD | NIC FQDD]\nracadm switchconnection refresh"
  },
  "systemerase ": {
    "description": "Allows you to erase the components to remove the server from use.",
    "syntax": "To erase a specific component.\nracadm systemerase <component>\n● To erase multiple components.\nracadm systemerase <component>,<component>,<component>",
    "input": "<component>—the valid types of components are\n○ bios—To reset the BIOS to default.\n○ diag—To erase embedded diagnostics.\n○ drvpack—To erase embedded OS driver pack.\n○ dpu—Erase all the user configurations from the supported DPUs.\n○ idrac—To reset the iDRAC to default.\n○ lcdata—To erase Lifecycle Controller data.\n○ allaps—To reset all apps.\n○ cryptographicerasepd—To erase the physical disk. This supports SED, NVMe drives, and PCIe\ncards\n○ overwritepd—To overwrite physical disk. This supports SAS and SATA drives.\n○ percnvcache—To erase NV cache.\n○ reinstallfw— To reinstall same firmware version detected for supported devices.\n○ vflash—To erase vFlash.\n○ nvdimm—To erase all NonVolatileMemory.\nNOTE: When BIOS is selected for System Erase, the server is turned off and the iDRAC is reset at\nthe end of the Automated Task Application. To complete the process of BIOS reset, the server power\nmust be restored. When the server is turned on, during POST, the BIOS completes the process of\nresetting to the default properties. At the completion of the reset process, the server is again turned\noff. Resetting the BIOS also includes the erasing of BIOS-related nonvolatile settings that are used by\nthe OS and embedded in the UEFI applications.\nNOTE: When the racadm systemerase command is executed, the iDRAC will take the following actions\nif the:\n● Server is powered off—it is powered on.\n● Server is powered on—a graceful system reboot will be executed.\n● ACPI is enabled on the server— a graceful shutdown occurs within a minute or two.\n● ACPI is not enabled—a forced shutdown occurs and it may require up to ten minutes to complete.\nFollowing the server reboot, the Lifecycle Controller will execute the System Erase job to carry out\nthe requested actions. All actions performed by the System Erase operations are recorded to the\nLifecycle Log, including details of all devices erased. When these actions are completed, the server will\nbe powered off and remain in this state, allowing service personnel to perform any needed posterase\nactions such as drive removal or hardware reconfiguration. When the server is powered on to return to\nservice, the Lifecycle Controller will collect the system inventory and reflect any hardware or firmware\nchanges made after the System Erase.\nracadm systemerase bios\nracadm systemerase diag\nracadm systemerase drvpack\nracadm systemerase dpu\nracadm systemerase idrac\nracadm systemerase lcdata\nracadm systemerase bios,diag,drvpack\nracadm systemerase bios,idrac,lcdata\nracadm systemerase allapps\n● racadm systemerase cryptographicerasepd\n● racadm systemerase overwritepd\n● racadm systemerase percnvcache\n● racadm systemerase reinstallfw\n● racadm systemerase vflash\n● racadm systemerase cryptographicerasepd,vflash,percnvcache\n● racadm systemerase nvdimm\nracadm systemerase cryptographicerasepd\nracadm systemerase overwritepd\nracadm systemerase percnvcache\nracadm systemerase reinstallfw\nracadm systemerase vflash\nracadm systemerase cryptographicerasepd,vflash,percnvcache\nracadm systemerase nvdimm"
  },
  "systemperfstatistics ": {
    "description": "Allows you to view and manage the system performance monitoring operations.",
    "syntax": "To view the FQDD's of system performance monitoring sensors\nracadm systemperfstatistics view\n● To list the usage statistics of a specific sensor\nracadm systemperfstatistics <sensor_FQDD>\n● To reset the utilization peaks of system performance monitoring sensors\nracadm systemperfstatistics PeakReset <FQDD>\n● To run the peakreset operation you must have configure iDRAC privilege."
  },
  "techsupreport ": {
    "description": "Allows you to perform the technical support report operations. Tech Support Report (TSR) is now\nknown as SupportAssist Collections and the new term is used in all documentation and GUI. To maintain\ncompatibility across server generations, the RACADM command has been retained as techsupreport. The\ntypes of operations are:\n● collect—Collects the technical support report data to export. You can specify the various types of\nlogs to be in the report. This operation generates a Job ID. Use this Job ID to check the status of the\ncollect operation. To run this operation, you must have the Server Control Commands permission.\n● export—Exports the collected Tech Support Report data. To run this subcommand, you must have\nthe Execute Server Control Commands permission.\n● getupdatetime—Gets the timestamp of the last operating system application data collection.\n● updateosapp—Updates the operating system application data collection. To run this subcommand,\nyou must have the Execute Server Control Commands permission.",
    "syntax": "To perform the technical support report operation by specifying the type of operation.\nracadm techsupreport <tech support report command type>\n● To collect the report data.\nracadm techsupreport collect [-t <type of logs>]\n● To export the collected report data.\nracadm techsupreport export -l <CIFS,NFS,TFTP,FTP> -u <username> -p\n<password>\n● To get the timestamp of the last operating system application data collection.\nracadm techsupreport getupdatetime\n● To update the operating system application data collection.\nracadm techsupreport updateosapp -t <type of OS App logs>\n● To export the collected report data to local share.\nracadm techsupreport export -f <filename>",
    "input": "-t—type of logs. You can specify any of the following values that are separated by a ‘,’ (comma)\n○ SysInfo—System Information\n○ OSAppNoPII—Filtered OS and Application data\n○ OSAppAll—OS and Application data\n○ TTYLog—TTYLog data\nNOTE:\n○ For updating the operating system application data collection, enter the value OSAppNoPII or\nOSAppAll to the -t option.\n○ If no value is specified and system information data is collected.\n○ To perform the OSLog collection, ensure that ISM is installed and running.\n○ TTYLog includes PCIeSSD data.\n● -l—network share location to export the report\n● -u—user name for the remote share to export the report\n● -p—password for the remote share to export the report\n● -f—target filename for the exported log.\nNOTE: The filename must have .zip as the extension.",
    "example": "s\t● To collect the system information data.\nracadm techsupreport collect —t <type of logs>\n● To collect the system information and TTYLog data.\nracadm techsupreport collect -t SysInfo,TTYLog\n● To collect the operating system application data.\nracadm techsupreport collect -t OSAppAll\n● To export the collected Tech Support Report, to an FTP share\nracadm techsupreport export -l ftp://192.168.0/share -u myuser -p xxx\n● To export the collected Tech Support Report, to a TFTP share\nracadm techsupreport export -l tftp://192.168.0/share\n● To export the collected Tech Support Report, to a CIFS share.\nracadm techsupreport export -l //192.168.0/share -u myuser -p xxx\n● To export the collected Tech Support Report, to an NFS share.\nracadm techsupreport export -l 192.168.0:/share\n● To export the collected Tech Support Report to the local file system.\nracadm techsupreport export -f tsr_report.zip"
  },
  "testalert ": {
    "description": "Tests FQDN supported SNMP trap notifications. To run this subcommand, you must have the Test Alert\nUser Access.",
    "syntax": "racadm testalert -i <index>",
    "input": "-i — Specifies the index of the trap test. index must be an integer from 1 to 8 on iDRAC.",
    "output": "Success: Test trap sent successfully\nFailure: Unable to send test trap",
    "example": "Test a trap with index as 1.\nracadm testalert -i 1\nTest trap sent successfully.\n● Test a trap that has not been configured yet.\nracadm testalert -i 2\nERROR: Trap at specified index is not currently enabled."
  },
  "testemail ": {
    "description": "Sends a test email from iDRAC to a specified destination. Prior to running the test email command, make\nsure that the SMTP server is configured. The specified index in the idrac.EmailAlert group must be enabled\nand configured properly. For more information, see Integrated Dell Remote Access Controller RACADM CLI\nGuide .",
    "syntax": "racadm testemail -i <index>",
    "input": "-i <index> — Specifies the index of the email alert to test.",
    "output": "Success: Test e-mail sent successfully Failure: Unable to send test e-mail",
    "example": "Commands for the idrac.EmailAlert group\n● Enable the alert.\nracadm set idrac.EmailAlert.1.Enable 1\n● Set the destination email address.\nracadm set idrac.EmailAlert.1.Address user1@mycompany.com\n● Set the custom message that is sent to the destination email address.\nracadm set idrac.emailalert.1.CustomMsg \"This is a test!\"\n● Make sure that the SMTP IP address is configured properly.\nracadm set idrac.remotehosts.SMTPServerIPAddress 192.168.0\n● View the current email alert settings.\nracadm get idrac.EmailAlert.<index>\nwhere <index> is a number from 1 to 8."
  },
  "testrsyslogconnection ": {
    "description": "Allows you to check the connection with Telemetry rsyslog server. The Telemetry feature requires\niDRAC9 DataCenter or OpenManage Enterprise Advanced license to run this command.",
    "syntax": "racadm testrsyslogconnection",
    "input": "testrsyslogconnection",
    "output": "A test connection to the rsyslog server was successful.",
    "example": "To test a Telemetry rsyslog connection\nracadm testrsyslogconnection"
  },
  "testtrap ": {
    "description": "Tests the RAC’s SNMP trap alerting feature by sending a test trap from iDRAC to a specified destination\ntrap listener on the network. To run this subcommand, you must have the Test Alert permission.\nNOTE:\n● Before you run the testtrap subcommand, make sure that the specified index in the RACADM\niDRAC.SNMPAlert group is configured properly.\n● The indices of testtrap subcommand is co-related to the indices of iDRAC.SNMPAlert group.",
    "syntax": "racadm testtrap -i <index>",
    "input": "-i <index> — Specifies the index of the trap configuration that must be used for the test. Valid values\nare from 1 to 4.",
    "example": "Enable the alert.\nracadm set idrac.emailalert.1.CustomMsg 1\nracadm set iDRAC.SNMPAlert.1.State 1\n● Set the destination email IP address.\nracadm set iDRAC.SNMPAlert.1.Destination\n192.168.0\n● View the current test trap settings.\nracadm get iDRAC.SNMPAlert.<index>\nwhere <index> is a number from 1 to 8"
  },
  "traceroute ": {
    "description": "Traces network path of the routers as the packets traverse from the system to a destination IPv4 address.\nTo run this subcommand, you must have the Execute Diagnostic Commands permission.",
    "syntax": "racadm traceroute <IPv4 address>",
    "input": "IPv4 — Specifies IPv4 address.",
    "output": "traceroute to 192.168.0.1 (192.168.0.1), 30 hops max, 40 byte packets\n1 192.168.0.1 (192.168.0.1) 0.801 ms 0.246 ms 0.253 ms"
  },
  "traceroute6 ": {
    "description": "Traces the network path of routers as the packets traverse from the system to a destination IPv6 address.\nTo run this subcommand, you must have the Execute Diagnostic Commands permission.",
    "syntax": "racadm traceroute6 <IPv6address>",
    "input": "<IPv6address> – Specifies IPv6 address.",
    "output": "traceroute to fd01::1 (fd01::1) from fd01::3,\n30 hops max, 16 byte packets\n1 fd01::1 (fd01::1) 14.324 ms 0.26 ms 0.244 ms"
  },
  "update subcommand ": {
    "description": "Allows you to update the firmware of devices on the server. The supported firmware image file types are\n● .exe — Windows-based Dell Update Package (DUP)\n● .d9\n● .pm\n● .sc\nThe supported catalog files are:\n● .xml\n● xml.gzip\nNOTE:\n● Updating the platforms from the repository is not supported for IPv6.\n● The firmware update through FTP has a limitation of file name up to 64 characters.\n● Depending on the network traffic, the HTTP packet transfer may fail if you perform update\noperation from a remote RACADM through a local share. In such cases, retry the operation. If\nthe issue persists, use remote RACADM with the CIFS or NFS share.\n● The supported share types for single file or DUP updates are CIFS, NFS, HTTP, and HTTPS. For\nRepository updates, the supported share types are CIFS, NFS, FTP, TFTP, and HTTP.\n● When a port number is appended to an IP address for firmware update, the job fails with an internal\nerror.\n● racadm update command mounts a partition on the iDRAC as a USB device when run from the\nlocal host Operating System.",
    "syntax": "For single file or DUP update\nracadm update -f <updatefile>\nracadm update -f <updatefile> -l <location> -u <username for CIFS share>\n-p <password for CIFS share>\nracadm update -f <updatefile> -l <location>\nFor Repository updates\nracadm update -f <catalog file> -t <Repository type> -l <location> \\ -u\n<username for CIFS share> -p <password for CIFS share> \\ [-a <restart>]\n[--verifycatalog]\nracadm update -f <catalog file> -t <Repository type> \\ -e <FTP server\nwith the path to the catalog file> [-a <restart>] \\[--verifycatalog]\nracadm update -f <catalog file> -t <Repository type> \\ -e <FTP server\nwith the path to the catalog file> [-a <restart>] \\ -ph <proxy ip> -pu\n<proxy user> -pp <proxy pass> -po <proxy port> \\\n-pt <proxy type>\nracadm update viewreport",
    "input": "For single file or DUP update\n● -f: <updatefile>—Update filename (Windows DUP, .d9,.pm, .sc) only.\n● -u: < username for CIFS share>—Specifies username of the remote share that stores the\nupdate file. Specify username in a domain as domain/username.\n● -p: <password for CIFS share—Specifies password of the remote share that stores the\nupdate file.\n● -l: <location>—Specifies network share location that stores the update file. For more information\non NFS or CIFS share, see section on Usage examples\n● —reboot—Performs a graceful system reboot after the firmware update.\nFor Repository update:\n● -f: <updatefile>—Update filename . For update from repository .xml files are allowed. If a\nfile name is not specified for repository update, Catalog.xml is taken as default. If a file name is not\nspecified for repository update, then the Catalog.xml is taken as default.\n● -u: < username for CIFS share>—Username of the remote share that stores the update file.\nSpecify username in a domain as domain/username.\n● -p: <password for CIFS share — Specifies password of the remote share that stores the\nupdate file.\n● -l: <location>—Specifies network share location (CIFS/NFS/HTTP/HTTPS/FTP), that stores\nthe update file. For more information on network share, see section on Usage examples\n● -a: <restart> — This option indicates if the server should be restarted after the update from\nrepository operation completes. Must be one of the below:\n○ TRUE : restart after update completes\n○ FALSE : do not restart after update completes\nNOTE: These options are case insensitive.\n● -t:Repository type>—Specifies the type of repository being used for the update. Must be one of\nthe below:\n○ FTP: Repository is FTP\n○ TFTP: Repository is TFTP\n○ HTTP: Repository is HTTP\n○ HTTPS: Repository is HTTPS\n○ CIFS: Repository is CIFS\n○ NFS: Repository is NFS\nNOTE: These options are case insensitive. If the repository update functionality is to be invoked,\nthis option is necessary.\n● -e:<FTP server with the path to the catalog file>—Specifies the Server path for\nthe FTP, TFTP, HTTP, and HTTPS.\n● -ph : <proxy ip>—Specifies the IP address of the proxy server.\n● -pu : <proxy user>—Specifies the user name for proxy credentials.\n● -pp : <proxy pass>—Specifies the password for proxy credentials.\n● -po : <proxy port>—Specifies the port for proxy server.\n● -pt : <proxy type>—Specifies the proxy type. Must be one of the below:\n○ HTTP: Proxy is HTTP\n○ SOCKS4: Proxy is SOCKS4\nNOTE:\n○ If the repository has to be through a proxy, the proxy server address, proxy username and the\nproxy password are necessary. The Lifecycle Controller must be enabled for repository update.\n○ This command supports both IPV4 and IPV6 formats. IPV6 is applicable only for CIFS and NFS\nremote share.",
    "output": "Firmware update job for <filename> is initiated. This firmware update job may take several minutes to\ncomplete depending on the component or firmware being updated. To view the progress of the job, run the\nracadm jobqueue view command. For repository update command, the output is:\nUpdate from repository operation has been initiated. Check the progress\nof the operation using \"racadm jobqueue view -i JID_809364633532\" command.\nFor devices that perform update process without rebooting the host, the update status changes from\nDownloading to Completed. For devices that require host reboot to perform update process, the\nupdate status changes from Downloading to Scheduled. When the status is displayed as Scheduled,\nreboot the host to start the update process. The following devices require host reboot to perform the\nupdate process:\n● Backplanes\n● BIOS\n● Complex programmable logic device (CPLD)\n● Hard disk drives\n○ Solid-state drives (SSD)\n● Network interface cards (NIC) or Fibre Channel (FC) cards\n● PCIe SSD devices\n● Power supply unit (PSU)\n● Storage controllers\n● Perform update from an FTP repository and reboot the server to apply the updates:\nracadm update -f Catalog.xml -e 192.168.11.10/Repo/MyCatalog -a TRUE -t\nFTP\n● Perform update from an FTP repository with authentication and reboot the server to apply the updates\nracadm update -f Catalog.xml -e 192.168.11.10/Repo/MyCatalog -u user -p\nmypass -a TRUE -t FTP\n● Perform update from a HTTP repository and restart the server to apply the updates.\nracadm update -f Catalog.xml -e 192.168.11.10/Repo/MyCatalog -a TRUE -t\nHTTP\n● Perform update from a TFTP repository and restart the server to apply the updates.\nracadm update -f Catalog.xml -e 192.168.11.10/Repo/MyCatalog -a TRUE\n-t TFTP\n● Perform update from an FTP repository through a proxy server.\nracadm update -f Catalog.xml -e 192.168.11.10/Repo/MyCatalog -a TRUE\n-ph 145.140.12.56 -pu prxyuser -pp prxypass -po 80 -pt http -t FTP\n● Perform update from an downloads.dell.com\nracadm update -f Catalog.xml.gz -e downloads.dell.com/Catalog -a TRUE\n-t HTTPS\n● View the comparison report generated when --verifycatalog is used.\nracadm update viewreport"
  },
  "usercertupload ": {
    "description": "Uploads a user certificate or a user CA certificate from the client to iDRAC. To run this subcommand, you\nmust have the Configure iDRAC permission.",
    "syntax": "racadm usercertupload -t <type> [-f <filename>] -i <index>",
    "input": "-t — Specifies the type of certificate to upload, either the CA certificate or server certificate.\n○ 1=user certificate\n○ 2=user CA certificate\n● -f — Specifies the filename of the certificate that must be uploaded. If the file is not specified, the\nsslcert file in the current directory is selected.\n● -i — Index number of the user. Valid values 2–16.",
    "output": "If upload is successful, the message User certificate successfully uploaded to the RAC.\nIf unsuccessful, appropriate error message is displayed.",
    "example": "To upload user certificate for user 6.\nracadm usercertupload -t 1 -f c:\\cert\\cert.txt -i 6"
  },
  "usercertview ": {
    "description": "Displays the user certificate or user CA certificate that exists on iDRAC.",
    "syntax": "racadm usercertview -t <type> [-A] -i <index>",
    "input": "-t —Specifies the type of certificate to view, either the user certificate or the user CA certificate.\n○ 1=user certificate\n○ 2=user CA certificate\n● -A —Prevents printing headers or labels.\n● -i —Index number of the user. Valid values are 2–16.",
    "example": "To view user certificate for user 6.\nracadm usercertview -t 1 -i 6\nSerial Number : 01\nSubject Information:\nCountry Code (CC) : US\nState (S) : Texas\nLocality (L) : Round Rock\nOrganization (O) : Dell Inc.\nCommon Name (CN) : iDRAC default certificate\nIssuer Information:\nCountry Code (CC) : US\nState (S) : Texas\nLocality (L) : Not Available\nOrganization (O) : Dell Inc.\nOrganizational Unit (OU): Remote Access Group\nCommon Name (CN) : iDRAC default certificate\nValid From : May 7 23:54:19 2017 GMT\nValid To : May 4 23:54:19 2027 GMT\nNOTE: Not Available is displayed for attribute values in the certificate that are not populated or\nconfigured."
  },
  "vflashpartition ": {
    "description": "Manages the partitions on the vFlash SD card.\nNOTE:\n● To run this subcommand, you must have the iDRAC Enterprise license.\n● After iDRAC restart, the status of the previous operation performed on the partition(s) is erased.",
    "syntax": "racadm vflashpartition <create | delete | status | list> -i<index>\n-o<label> -e<emulation type> -s<size> -f<format type> -t<partition type>\n-l<path> -u<user> -p<password> -a",
    "input": "-o — Label that is displayed when the partition is mounted on the operating system. This option must\nbe a string of up to six alphanumeric characters. VFLASH is the only accepted volume label for non-Dell\nSD card.\n● -e — Emulation type must be either floppy, cddvd, or hdd.\n○ floppy — emulates a floppy disk\n○ cddvd — emulates a CD or DVD\n○ hdd — emulates a hard disk\n● -s — Partition size in MB.\n● -f — Format type for the partition based on the type of the file system. Valid options are raw, ext2,\next3, fat16, and fat32.\n● -t — Create a partition of the following type:\n○ empty — Creates an empty partition\n○ image — Creates a partition using an image relative to iDRAC.\nCreation of a partition may be unsuccessful if:\n○ The network share is not reachable.\n○ The user name or password provided is not correct.\n○ The file provided does not exist.\n○ The memory available on the SD card is lesser than size of the image file.\n● -l — Specifies the remote path relative to iDRAC.\n● -u — User name for accessing the remote image.\n● -p — Password for accessing the remote image.\n● -a — Display the status of operations on all the existing partitions.\n● list — Lists the existing partitions and its properties.",
    "example": "Create a 20MB empty partition.\nracadm vflashpartition create -i 1 -o Drive1 -e hdd -t empty -f fat16\n-s 20\n● Create a partition from a remote image.\nracadm vflashpartition create -i 1 -o Drive1 -e cddvd -t image -l\n//ipaddress/sharefolder/isoimge.iso -u username -p xxx\nA new partition is created. By default, the created partition is read-only. This command is case-sensitive\nfor the image filename extension. If the filename extension is in uppercase, for example FOO.ISO\ninstead of FOO.iso, then the command returns a syntax error.\nNOTE:\n○ This feature is not supported in Local RACADM.\n○ Creating vFlash partition from an image file on the CFS or NFS IPv6 enabled network share is\nnot supported.\n● Delete a partition.\nracadm vflashpartition delete -i 1\n● Status of operation on partition 1.\nracadm vflashpartition status -i 1\n● Status of all the existing partitions.\nracadm vflashpartition status -a\n● List all the existing partitions and its properties.\nracadm vflashpartition list"
  },
  "vflashsd ": {
    "description": "Allows you to initialize or get the status of the vFlash SD card. The initialize operation removes all the\nexisting partitions and resets the card. The status operation displays the status of the last operation\nperformed on the card. To run this subcommand, you must have the Access Virtual Media privilege.\nNOTE: After you restart the iDRAC, the status of the previous initialize operation is erased.",
    "syntax": "racadm vflashsd initialize\n● racadm vflashsd status",
    "input": "Initialize— performs initialize operation on SD card.\n● Status — indicates to view the progress or status report of the initialize operation.",
    "output": "If initialization is in progress, the message Initialization of the vFlash SD Card\nis now in progress is displayed. If unsuccessful, appropriate error message is displayed. If\nthe status of the last operation performed is successful, the message LastAction Progress\nStatus=============Initialize SD Card 100 % Complete is displayed. If unsuccessful,\nappropriate error message is displayed."
  },
  "vmdisconnect ": {
    "description": "Allows you to end another Virtual Media session. After the session ends, the web-based interface reflects\nthe correct connection status. Enables an iDRAC user to disconnect all active Virtual Media sessions. The\nactive Virtual Media sessions are displayed on iDRAC web-based interface or by running the RACADM\nsubcommands remoteimage or getssninfo. To run this subcommand, you must have the Access\nVirtual Media permission.",
    "syntax": "racadm vmdisconnect"
  },
  "witnessnodepoweraction ": {
    "description": "The witnessnodepoweraction command is used to perform witness node power management operations.",
    "syntax": "racadm witnessnodepoweraction <action>",
    "input": "<action> - Specifies the witness node power management operation to perform. The possible values\nare:\n● powerdown : power witness node off\n● powerup : power witness node on\n● hardreset : force hard witness node power reset\n● reseat : re-seat witness node\n● powerstatus : display current power status of witness node"
  }
}